{
    "chatMessages": [
        "The volcano state notifier can be toggled on or off by pressing the 'x' key",
        "The volcano monitor can be toggled on or off by pressing the 'z' key",
        "Private server owners have owner only commands that allows them to mute/kick/ban players from their server",
        "Fun fact: This game loads its volcanoes from a json file hosted on Github. The repo name is 'azrellie/gamedata'",
        "This game has custom commands. Type '/' in the chat bar to see a list of them",
        "The UI can be toggled on or off by pressing 'm'",
        "Volcano state notifier and volcano monitor will only be free during alpha testing to ensure all bugs associated with them are fixed",
        "The P and S wave arrival times of earthquakes in this game assumes that the position from the earthquake is directly at the epicenter",
        "The Mercalli scale itensity calculation is still being worked on, so some earthquakes may have unrealistically low/high MMI ratings.",
        "This game has an official board to see upcoming updates. Join the server to get a link to it.",
        "If volcanic activity suddenly has a massive spike, there is a potential that a very large volcanic eruption is about to occur.",
        "Major earthquakes can cause big volcanoes to become active, albeit it is somewhat rare.",
        "There are 302 volcanoes and 347 fault lines in the game.",
        "Only 11 fault lines out of 347 are capable of producing Magnitude 10 earthquakes.",
        "10 earthquakes spawn on fault lines every second! Magnitude 10 quakes are exceptionally rare.",
        "Did you know that this game has nearly 15,000 lines of code, which totals up to 454 kb?"
    ]
    "funFacts": [
        "[Meteorology Fact] On reflectivity radar, quarter (0.25) inch hail becomes possible at 50 dBZ, and 60 dBZ is when 1 inch hail becomes possible and can get the storm severe warned.",
        "[Meteorology Fact] In order for a thunderstorm to be considered severe, it has to meet one of 3 criteria.\n1. Wind gusts of 58 mph or higher\n2. 1\" or larger hail\n3. Produced a tornado",
        "[Meteorology Fact] There is 3 types of supercells, low precipitation, classic and high precipitation supercells. LP supercells have their updraft on the rear flank of the storm, which creates a corkscrew appearanace, and have little to no precipitation. Classic supercells have a large flat updraft base with striations of banding seen around the periphery of the updraft. heavy precip falls adjacent to the updraft with large hail likely. classic supercells make up most supercells. HP supercells will have their updraft on the front flank of the storm and precipitation that almost surrounds the updraft, and will have a high chance to have a wall cloud. Rain wrapped tornadoes come from high precip supercells and can cause flash flooding.",
        "[Meteorology Fact] A downburst is a strong surge of air that falls to the ground and spreads in all directions. If the downburst is less than 2.5 miles wide, its called a microburst. And if its over 2.5 miles wide, its called a macroburst.",
        "[Meteorology Fact] Two types of microbursts exist. Dry microburst and wet microburst. Dry microbursts have no rain which makes it hard to spot, with the only real detection of dust being kicked up. Wet microbusrsts have a lot of rain and can be tricky to spot but easier than dry microbursts.",
        "[Meteorology Fact] A dry microburst forms when air below a thunderstorm is very dry and the rain evaporates into the dry air cooling it down, which causes it to fall down to the surface spreading out on impact. A wet microburst forms when dry air enters a thunderstorm and rain evaporates cooling the dry air which causes it to fall down to the surface.",
        "[Meteorology Fact] A downburst can produce winds over 100 mph for a short period of time, which is capable of causing significant damage.",
        "[Meteorology Fact] Differential Reflectivity (ZDR) measures how uniform a hydrometeor is and can be used to get the precipitation type, as well as the intensity of the precipitation and measures between -8 to 8. Values below 0 indicate a more vertically sized hydrometeor, while values near or at 0 indicate a rather uniform hydrometeor (such as hail), and values over 0 indicate a more horizontially sized hydrometeor (such as rain drops). High positive differential reflectivity values can be an indicator of very heavy precipitation.",
        "[Meteorology Fact] Specific Differential Phase (KDP) can be used to measure the concentration of rain drops, which usually means an increase in rain rate. KDP is useful for finding areas with the heaviest precipitaiton.",
        "[Meteorology Fact] Correlation Coefficient (CC) can be used to distinguish from meteorological and non meteorological targets. Deep CC drops (usually blue) are a common indicator of tornadic debris, while slightly less deeper CC drops (green to yellow) can indicate of hail of at least 1 inch or more.",
        "[Meteorology Fact] Base Reflectivity (BR) is commonly used to measure the general intensity of precipitation. Light rain usually begins at 20 dBZ (usually green) and heavy rain usually begins at 50 dBZ (usually red). Small hail is also possible at 50 dBZ and at 60 dBZ (usually pink), 1 inch hail becomes possible. 60+ dBZ is also an indicator of tornadic debris lifted high up into the updraft of the thunderstorm.",
    	"[Meteorology Fact] Composite Reflectivity (uses dBZ, like base reflectivity) displays the strongest echo signal from all elevation scans and shows the maximum value (dBZ) of reflectivity in the air column above that point.",
        "[Meteorology Fact] Storm Relative Velocity (SRV) measures the motion of the wind subtracted by the storms own movement speed. Green means the wind is moving towards the radar, while red means the wind away from the radar. Grey means its not moving toward or away from the radar. Storm Relative Velocity is commonly used to detect rotation in thunderstorms. these are often called 'velocity couplets' and is an area of 2 opposite velocities meeting. This will depend on where the rotation is at relative to the radar though. if the rotation is north of the radar, then the bottom couplet should be green while the top couplet should be red.\n2. South of the radar, then the bottom couplet should be red while the top couplet should be green. SRV can also be used to check for downbursts by checking for diverging winds and the strength of those winds. Converging winds indicate the development of a downburst.",
        "[Meteorology Fact] Enviroment Lapse rate (expressed in C/km) is a measure of how much the temperature changes with altitude in the atmosphere. If the ELR is less than the DALR and MALR, then its stable. If the ELR is less than the DALR and higher than MALR, then its conditionally unstable. If the ELR is higher than the MALR and DALR, then its absolutely unstable.",
    	"[Meteorology Fact] 3 things must be present for thunderstorms to even form.\n1. Atmospheric instability\n2. Wind shear\n3. Lift\nIts one thing if the air is unstable, but it can't really do anything if its not able to rise up to colder parts of the atmosphere. Wind shear is necessary for the thunderstorms updraft which fuels it. If the updraft is cut off from the main storm, the storm begins to weaken and eventually dissipate.",
    	"[Meteorology Fact] A tornado warning is issued if rotation is present on the ground and/or doppler radar, even if no tornado is actually present. If a tornado is on the ground, the warning bulletin will specifically say that its on the ground.",
        "[Meteorology Fact] Positive lightning is way more intense than negative lightning. Positive lightning can be up to a billion volts at 300,000 amps. The pulse also lasts longer which can increase the chances of a wildfire. Most lightning induced wildfires occur because of positive lightning. Positive lightning can travel way further from the storm, which is why its so much more dangerous than negative lightning as you dont even have to be in the storm to get struck.",
        "[Meteorology Fact] 70+ dBZ on reflectivity radar can indicate very large hail, up to 2 inches or more.",
        "[Meteorology Fact] Around 90% of lightning strikes are negative strikes while the other 10% are positive strikes.",
    	"[Meteorology Fact] The dry adiabatic lapse rate is the change in temperature with altitude and is a constant. The dry adiabatic lapse rate is 9°C/km or 5.4°F/1kft",
    	"[Meteorology Fact] The surface dewpoint must be 55 degrees or more for surface based thunderstorms to form.",
        "[Meteorology Fact] Dew point is the temperature that the air must be cooled too where moisture in the air condenses. The dew point can never be higher than the air temperature.",
        "[Meteorology Fact] Relative humidity is the amount of moisture in the air relative to its temperature. Warm air can hold more moisture, cold air can hold less.",
        "[Meteorology Fact] A severe weather statement is an alert issued by the NWS to provide updated information on an active severe thunderstorm or tornado warning.",
        "[Meteorology Fact] A severe thunderstorm emergency has actually occured once in Scottsbluff Nebraska. The storm its self had produced up to 60 mph wind gusts and 3 inch size hail. The NWS has no specific criteria for a severe thunderstorm emergency, but may be similar to how a PDS tornado warning threatening a populated area can become a tornado emergency.",
    	"[Meteorology Fact] Since august 2nd 2021, the NWS has started giving severe thunderstorms 'destructive' and 'considerable' damage threat tags. The criteria for 'considerable' has to be at least 1 of these requirements:\nHail: 1.75\" to 2.5\"\nWind: 70-79 mph.\nThe criteria for 'destructive' has to be at least 1 of these requirements:\nHail: >2.75\"\nWind: >80 mph.",
        "[Meteorology Fact] If there is little vertical speed shear in the atmosphere, then severe thunderstorms are unlikely to develop because the downdraft eventually falls back down on the updraft, cutting off the storm from its source of fuel. Low vertical speed shear also can limit movement of thunderstorms."
    ]
}
