{
    "stratovolcanoDefinition": "A conical shaped volcano formed by hundreds of layers of hardened lava and tephra and can be thousands of feet tall. Can produce very explosive eruptions or caldera forming eruptions, similar to Crater Lake during its VEI 7 super eruption.",
    "cinderConeDefinition": "A conical shaped volcano made of loose pyroclastic material. Usually does not last long and goes extinct after its first few eruptions.",
    "shieldDefinition": "A wide, usually short (from sea level), volcano formed similarly to stratovolcanoes, but with very viscous basaltic lava that flows down the mountain. Normally produces effusive eruptions no more than VEI 4.",
    "volcanoes": [
        {
            "name": "St. Helens",
            "vei": 6,
            "coordinates": [46.195585783508754, -122.18897141900877],
            "type": "Stratovolcano",
            "summitFeet": 8362,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Washington state that is responsible for the 1980 eruption of Mount St. Helens that covered most of north Washington in ash along with other states downwind east. The entire north flank of the volcano collapsed right as the eruption begun and caused a massive landslide because of a magnitude 5.1 earthquake directly under the north flank. The eruption was determined to be a VEI 5."
        },
        {
            "name": "Vesuvius",
            "vei": 6,
            "coordinates": [40.821337267833876, 14.42591306434018],
            "type": "Stratovolcano",
            "summitFeet": 4202,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Naples Italy, infamous for its VEI 5 eruption in 79 AD that buried Pompeii in ash and leveled buildings with pyroclastic flows. Mount Vesuvius is thought to be overdue for another eruption in the near future."
        },
        {
            "name": "Jefferson",
            "vei": 5,
            "coordinates": [44.67440741598983, -121.79962089096446],
            "type": "Stratovolcano",
            "summitFeet": 10497,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Oregon that has not erupted in over 1000 years. Not much is known about this volcano as there are only 2 confirmed eruptions in its entire 100,000 years since it began. Jefferson is the second highest mountain in Oregon."
        },
        {
            "name": "Baker",
            "vei": 7,
            "coordinates": [48.77668839068164, -121.81441320396915],
            "type": "Stratovolcano",
            "summitFeet": 10786,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Washington state that sits really close to the border of Canada. Baker has the largest glacier cover of any of the cascade volcanoes and sits only 28 miles from Abbotsford in Canada."
        },
        {
            "name": "Adams",
            "vei": 2,
            "coordinates": [46.202439318033306, -121.49103546466154],
            "type": "Stratovolcano",
            "summitFeet": 12276,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Washington state that is adjacent and sits further east to St. Helens. Currently has only produced low explosivity eruptions in the past 8000 years."
        },
        {
            "name": "Yellowstone",
            "vei": 8,
            "coordinates": [44.36880150435362, -110.72187055142369],
            "type": "Caldera",
            "summitFeet": 9202,
            "magmaType": "Rhyolite",
            "desc": "A supervolcano in Wyoming that is very well known for its 3 super eruptions in the last 2.1 million years and Old Faithful geyser. Old Faithful erupts on a daily basis and is often very predictable of its next eruptions."
        },
        {
            "name": "Kīlauea",
            "vei": 4,
            "coordinates": [19.406920810396706, -155.283369002341],
            "type": "Shield",
            "summitFeet": 4009,
            "magmaType": "Basalt",
            "desc": "A very active shield volcano in Hawaii that erupts very frequently with mostly effusive eruptions, but has on occasion produced much larger eruptions going as high as VEI 4."
        },
        {
            "name": "Mauna Loa",
            "vei": 2,
            "coordinates": [19.472212232405933, -155.5921872240247],
            "type": "Shield",
            "summitFeet": 13681,
            "magmaType": "Basalt",
            "desc": "A very active shield volcano in Hawaii. Similar to Kilauea, eruptions are frequent and mainly effusive. If we measure height from the sea floor, it would be taller than Everest by 1000 feet, just behind Mauna Kea at 4500 feet taller than Everest."
        },
        {
            "name": "Rainier",
            "vei": 5,
            "coordinates": [46.85232525812001, -121.76030611133204],
            "type": "Stratovolcano",
            "summitFeet": 14409,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Washington state that is just 42 miles from Tacoma. Rainier is the tallest mountain in Washington at 14409 feet and is considered an active volcano. Rainier poses a larger threat to Seattle due to its proximity and the fact its twice the size of St. Helens."
        },
        {
            "name": "Glacier Peak",
            "vei": 5,
            "coordinates": [48.11198353291689, -121.11327801525596],
            "type": "Stratovolcano",
            "summitFeet": 10541,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in Washington state that is a rather short volcano compared to Rainier due to it being on a high ridge. As of 2018, Glacier Peak is considered as 1 of 18 most dangerous volcanoes in the US."
        },
        {
            "name": "Hunga Tonga-Hunga Ha'apai",
            "vei": 6,
            "coordinates": [-20.543965427394934, -175.3925422395425],
            "type": "Caldera",
            "summitFeet": 374,
            "magmaType": "Basalt",
            "desc": "A caldera volcano located in the Tongan archipelago in the southern Pacific Ocean. This volcano experienced a large explosive eruption from 2021-2022. This eruption produced an atmospheric shockwave that circled the entire globe."
        },
        {
            "name": "Fentale",
            "vei": 0,
            "coordinates": [8.983631311738952, 39.9043255105911],
            "type": "Stratovolcano",
            "summitFeet": 6585,
            "magmaType": "Rhyolite",
            "desc": "A stratovolcano located in Ethiopia. This volcano primarily has effusive eruptions as that is all thats known currently."
        },
        {
            "name": "Erebus",
            "vei": 6,
            "coordinates": [-77.52923982198418, 167.14937536834583],
            "type": "Stratovolcano",
            "summitFeet": 12448,
            "magmaType": "Rhyolite",
            "desc": "A stratovolcano located in Antarctica. This volcano is the southernmost volcano in the world. The summit caldera was created by an explosive VEI 6 eruption roughly 18,000 years ago."
        },
        {
            "name": "Fuji",
            "vei": 5,
            "coordinates": [35.36298483072634, 138.73069033728524],
            "type": "Stratovolcano",
            "summitFeet": 12448,
            "magmaType": "Basalt",
            "desc": "A stratovolcano located in Japan. This volcano is very well known in Japan and has the classic shape of a volcano."
        },
        {
            "name": "Calatrava",
            "vei": 2,
            "coordinates": [38.86726087897647, -4.013833070232816],
            "type": "Volcanic Field",
            "summitFeet": 3665,
            "magmaType": "Basalt",
            "desc": "A volcanic field located in Spain. Little is known about this volcanic field with only 1 confirmed eruption 5600 years ago."
        },
        {
            "name": "Toba",
            "vei": 9,
            "coordinates": [2.6230544890703964, 98.79301296789286],
            "type": "Caldera",
            "summitFeet": 3665,
            "magmaType": "Rhyolite",
            "desc": "A caldera volcano in Sumatara Indonesia that is the culprit for the Toba catastrophe 74000 years ago, killing off nearly everyone on the planet. With only 3,000-10,000 survivors. This eruption was believed to be of a VEI 8, but has recently been recategorized as a VEI 9 due to the logarithmic nature of the Volcanic Explosivity Index."
        },
        {
            "name": "Pinatubo",
            "vei": 6,
            "coordinates": [15.142870220627742, 120.34954869637257],
            "type": "Stratovolcano",
            "summitFeet": 4875,
            "magmaType": "Andesite",
            "desc": "A stratovolcano in the Philippines that produced a very explosive VEI 6 eruption in 1991, of which destroyed the whole mountain forming a large caldera."
        },
        {
            "name": "Taal",
            "vei": 6,
            "coordinates": [14.011270856337395, 120.99770205362611],
            "type": "Caldera",
            "summitFeet": 4875,
            "magmaType": "Andesite",
            "desc": "A caldera in the Philippines that has had several violent eruptions in the past killing thousands, and is labeled a decade volcano due to its proximity to populated areas."
        },
        {
            "name": "Vulcan's Throne",
            "vei": 1,
            "coordinates": [36.21713336369398, -113.0780383531076],
            "type": "Cinder Cone",
            "summitFeet": 5102,
            "magmaType": "Basalt",
            "desc": "A cinder cone near the Grand Canyon in Arizona. This volcano is part of the Uinkaret volcanic field."
        },
        {
            "name": "Sunset Crater",
            "vei": 4,
            "coordinates": [35.36403667602787, -111.50304748451815],
            "type": "Cinder Cone",
            "summitFeet": 12631,
            "magmaType": "Basalt",
            "desc": "A cinder cone north east of Flagstaff Arizona that produced a VEI 4 eruption roughly 1000 years ago. The area around the volcano is still covered in tephra, while the volcano its self is considered extinct."
        },
        {
            "name": "Campi Flegrei",
            "vei": 7,
            "coordinates": [40.82719571514453, 14.139105835113167],
            "type": "Caldera",
            "summitFeet": 12631,
            "magmaType": "Rhyolite",
            "desc": "A rather small looking caldera in Italy near Vesuvius, that sits right in the middle of Naples. This volcano is an extremely high threat due to it being directly in the middle of a major city, which a likely chance of an eruption in the future, and is considered a supervolcano, meaning there is a chance for a super eruption to occur right in the middle of a major city."
        },
        {
            "name": "Long Valley",
            "vei": 7,
            "coordinates": [37.664664230355, -118.78804937818482],
            "type": "Caldera",
            "summitFeet": 12631,
            "magmaType": "Rhyolite",
            "desc": "A large caldera in California, that produced significant unreset in 1980 following an earthquake swarm and 10 inches of uplift within the caldera. Long Valley is placed 18th place in the USGS Volcanic Threat Assessment as a 'high risk' volcano."
        },
        {
            "name": "Modoc Plateau",
            "vei": 4,
            "coordinates": [41.500197332242216, -121.00135964698391],
            "type": "Cinder Cone",
            "summitFeet": 9159,
            "magmaType": "Basalt",
            "desc": "A large volcanic plateau in California, that produced thick lava accumulations, tuff beds, volcanic cones and cinder cones."
        },
        {
            "name": "Coso",
            "vei": 3,
            "coordinates": [36.03332942617726, -117.8166684253838],
            "type": "Cinder Cone",
            "summitFeet": 6283,
            "magmaType": "Rhyolite",
            "desc": "A volcanic field in California, that erupted 39 thousand years ago. This Volcanic Field produced, basalt lava flows, rhyolite lava domes, rhyolite lava flows, tuff rings."
        },
        {
            "name": "Popocatépetl",
            "vei": 6,
            "coordinates": [19.02324983435253, -98.62385037278861],
            "type": "Stratovolcano",
            "summitFeet": 17694,
            "magmaType": "Andesite",
            "desc": "Popocatépetl is a stratovolcano in Mexico. Popocatépetl is one of the most active volcanoes in Mexico and the most famous, having had more than 15 major eruptions since the arrival of the Spanish in 1519."
        },
        {
            "name": "La Garita Caldera",
            "vei": 8,
            "coordinates": [37.756729692702365, -106.93419477234536],
            "type": "Caldera",
            "summitFeet": 13711,
            "magmaType": "Rhyolite",
            "desc": "La Garita is a caldera in the USA. The scale of La Garita volcanism was the second greatest of the Cenozoic Era. The resulting Fish Canyon Tuff has a volume of approximately 5,000 km3 (1,200 cubic miles), giving it a Volcanic Explosivity Index rating of 8."
        },
        {
            "name": "Misema Caldera",
            "vei": 8,
            "coordinates": [48.38998333086064, -79.45004126750426],
            "type": "Caldera",
            "summitFeet": 13711,
            "magmaType": "Rhyolite",
            "desc": "Misema is a caldera in Canada. Misema Caldera is the oldest and largest caldera associated with the Blake River Megacaldera Complex and is comparable in size to Lake Toba caldera in Indonesia."
        },
        {
            "name": "La Pacana",
            "vei": 8,
            "coordinates": [-23.16702196153157, -67.41680791816795],
            "type": "Caldera",
            "summitFeet": 14800,
            "magmaType": "Rhyolite",
            "desc": "La Pacana is a caldera in Bolivia. La Pacana is a supervolcano and is responsible for the eruption of the giant Atana ignimbrite, which reaches a volume of 2,500–3,500 cubic kilometres (600–840 cu mi) and constitutes the fifth-largest explosive eruption known."
        },
        {
            "name": "Taupo",
            "vei": 8,
            "coordinates": [-38.7998115708119, 175.90255126419189],
            "type": "Caldera",
            "summitFeet": 1483,
            "magmaType": "Rhyolite",
            "desc": "Taupo is a caldera in New Zealand. Taupō began erupting about 300,000 years ago. The main eruptions that still affect the surrounding landscape are the dacitic Mount Tauhara eruption 65,000 years ago, the Oruanui eruption about 26,500 years ago, which is responsible for the shape of the modern caldera, and the Hatepe eruption, dated 232 ± 10 CE."
        },
        {
            "name": "Long Island",
            "vei": 7,
            "coordinates": [-5.334870681654999, 147.11459922283726],
            "type": "Caldera",
            "summitFeet": 4199,
            "magmaType": "Rhyolite",
            "desc": "Long Island is a caldera in Papua New Guinea. According to findings by archaeologists, it is believed that the island was first inhabited by humans approximately 1000 years ago. The discovery of obsidian and pottery fragments from diverse cultures at these dig sites has provided compelling evidence of the island's inhabitants engaging in extensive trade networks, indicative of their active participation in regional trade routes."
        },
        {
            "name": "Wah Wah Springs",
            "vei": 8,
            "coordinates": [38.47986542029199, -113.48921456463835],
            "type": "Caldera",
            "summitFeet": 4880,
            "magmaType": "Rhyolite",
            "desc": "Wah Wah Springs is a caldera in the USA. Over 30 million years ago Wah Wah Springs ejected over 5,900 km3 of tephra, producing the second most powerful confirmed eruption on Earth."
        },
        {
            "name": "Young Island",
            "vei": 7,
            "coordinates": [-66.4260941676481, 162.443586801336],
            "type": "Stratovolcano",
            "summitFeet": 4396,
            "magmaType": "Rhyolite",
            "desc": "Young island is a stratovolcano in Antarctica. On some days near the Southern Hemisphere summer solstice, Young Island is the first place on land to have a sunrise - that is, the sun sets very briefly, and then rises again earlier in the day than anywhere else on Earth."
        },
        {
            "name": "Rinjani",
            "vei": 7,
            "coordinates": [-8.411565183950062, 116.42270559609011],
            "type": "Stratovolcano",
            "summitFeet": 4396,
            "magmaType": "Rhyolite",
            "desc": "Rinjani is a stratovolcano in Indonesia. The volcano and the caldera are protected by the Gunung Rinjani National Park established in 1997. Tourism is increasingly popular with trekkers able to visit the rim, make their way into the caldera or even to make the more arduous climb to the highest point; fatalities, however, are not unheard of."
        },
        {
            "name": "Torfajökull",
            "vei": 3,
            "coordinates": [63.894411843175, -19.025857729752456],
            "type": "Stratovolcano",
            "summitFeet": 6585,
            "magmaType": "Basalt",
            "desc": "Torfajökull is a stratovolcano in Iceland. According to a legend, the glacier is named for Torfi Jónsson í Klofa, an Icelandic historical figure. When the plague arrived in Iceland in 1493, Torfi fled with his family and his belongings into the highlands and settled in a valley surrounded by the glacier."
        },
        {
            "name": "Crater Lake",
            "vei": 7,
            "coordinates": [42.941643357547626, -122.1066411116429],
            "type": "Caldera",
            "summitFeet": 8159,
            "magmaType": "Rhyolite",
            "desc": "Crater Lake is a caldera in the USA. The lake and surrounding park areas offer many recreational activities, including hiking, biking, snowshoeing, fishing, and cross-country skiing, and during the summer, campgrounds and lodges at Crater Lake are open to visitors."
        },
        {
            "name": "O'a Caldera",
            "vei": 7,
            "coordinates": [7.4936157475907, 38.56084021073614],
            "type": "Caldera",
            "summitFeet": 6808,
            "magmaType": "Andesite",
            "desc": "O'a is a caldera in Ethiopia. It has two lakes: Lake Shala and a small maar called Lake Chitu. Sub-features include Mount Fike (a pyroclastic cone) and Mount Billa (a cinder cone)."
        },
        {
            "name": "Emory Caldera",
            "vei": 8,
            "coordinates": [32.683893739084304, -108.13474204955875],
            "type": "Caldera",
            "summitFeet": 5722,
            "magmaType": "Rhyolite",
            "desc": "Emory Caldera is a caldera in the USA. The eruption of the Emory caldera was followed by formation of a resurgent dome as the caldera floor was pushed back upwards by fresh injections of magma. Thick beds of densely welded intracaldera Kneeling Nun Tuff are exposed in the heavy faulted resurgent dome, which forms the core of the Black Range."
        },
        {
            "name": "Vilama",
            "vei": 8,
            "coordinates": [-22.462786835704083, -66.98271955805137],
            "type": "Caldera",
            "summitFeet": 17520,
            "magmaType": "Rhyolite",
            "desc": "Vilama is a caldera in Bolivia. The Vilama caldera was originally estimated to have a size of 40 by 65 kilometres (25 mi × 40 mi) but the size was later revised to be between 15–18 kilometres (9.3–11.2 mi) and 35–40 kilometres (22–25 mi) and is almost entirely buried beneath younger volcanoes that have grown along the margin of the caldera; volcanic activity on these volcanoes continued into the Pleistocene."
        },
        {
            "name": "Rincón de la Vieja",
            "vei": 6,
            "coordinates": [10.831295912889297, -85.33665204236283],
            "type": "Complex",
            "summitFeet": 6286,
            "magmaType": "Andesite",
            "desc": "Rincón de la Vieja is a complex volcano in Costa Rica. There are many hot pools and areas of bubbling mud in two areas on the slopes of the volcano, indicating substantial reserves of geothermal energy. Investigations have been carried out into the feasibility of tapping these reserves, and the volcano is estimated to have a generating potential of 140 megawatts. However, as the area is protected within a national park, drilling was limited to test wells until 2001."
        },
        {
            "name": "Santa María",
            "vei": 6,
            "coordinates": [14.756336612277721, -91.55341345311285],
            "type": "Stratovolcano",
            "summitFeet": 12287,
            "magmaType": "Andesite",
            "desc": "Santa María is a stratovolcano in Guatemala. Eruptions at Santa María are estimated to have begun about 103 ka. Construction of the volcanic edifice occurred in four phases, from 103–72, 72, 60–46, and 35–25 ka, building up the large cone that reaches about 1,400 metres (4,600 ft) above the plain on which the nearby city of Quetzaltenango sits."
        },
        {
            "name": "Öræfajökull",
            "vei": 6,
            "coordinates": [63.98101512877263, -16.655125554661147],
            "type": "Stratovolcano",
            "summitFeet": 6921,
            "magmaType": "Basalt",
            "desc": "Öræfajökull is a stratovolcano in Iceland. The original Norse settlers named the volcano Knappafellsjǫkull. The current name, Öræfajökull, was eventually adopted after the 1362 eruption."
        },
        {
            "name": "Novarupta",
            "vei": 6,
            "coordinates": [58.26542832190407, -155.15895523176025],
            "type": "Caldera",
            "summitFeet": 12287,
            "magmaType": "Rhyolite",
            "desc": "Novarupta is a caldera in Alaska. The 1912 eruption that formed Novarupta was the largest to occur during the 20th century."
        },
        {
            "name": "Piton de la Fournaise",
            "vei": 5,
            "coordinates": [-21.243919069475776, 55.713713905098494],
            "type": "Stratovolcano",
            "summitFeet": 8635,
            "magmaType": "Rhyolite",
            "desc": "Piton de la Fournaise is a shield volcano in Réunion. Residents of Réunion sometimes refer to Piton de la Fournaise simply as le Volcan. It is a major tourist attraction."
        },
        {
            "name": "Kilimanjaro",
            "vei": 4,
            "coordinates": [-3.0648288335951084, 37.35838523543314],
            "type": "Stratovolcano",
            "summitFeet": 19341,
            "magmaType": "Andesite",
            "desc": "Kilimanjaro is a stratovolcano in Tanzania. The volcanic interior of Kilimanjaro is poorly known because there has not been any significant erosion to expose the igneous strata that comprise the volcano's structure."
        },
        {
            "name": "Okmok",
            "vei": 6,
            "coordinates": [53.427344343428565, -168.1287185246248],
            "type": "Shield",
            "summitFeet": 3520,
            "magmaType": "Andesite",
            "desc": "Okmok is a shield volcano in the Aleutian Islands. An algorithm that processes satellite-derived thermal images of the ground to identify anomalous areas, was developed after the 1996 Pavlof eruption and renamed Okmok Algorithm after the 1997 eruption of Okmok, to which it was first applied."
        },
        {
            "name": "Deception Island",
            "vei": 6,
            "coordinates": [-62.95594349759071, -60.63220129442359],
            "type": "Caldera",
            "summitFeet": 3520,
            "magmaType": "Rhyolite",
            "desc": "Deception Island is a caldera in Antarctica. The island previously held a whaling station. It is now a tourist destination with over 15,000 visitors per year."
        },
        {
            "name": "Cotopaxi",
            "vei": 6,
            "coordinates": [-0.683733052705245, -78.43695596186541],
            "type": "Stratovolcano",
            "summitFeet": 19393,
            "magmaType": "Andesite",
            "desc": "Cotopaxi is a stratovolcano in Ecuador. According to locals who speak Quechua, coto means Neck and paxi means Moon. This refers to the crater of Cotopaxi that looks like a crescent moon."
        },
        {
            "name": "Puyehue-Cordón Caulle",
            "vei": 6,
            "coordinates": [-40.582676034219, -72.11227086139536],
            "type": "Complex",
            "summitFeet": 19393,
            "magmaType": "Rhyolite",
            "desc": "Puyehue-Cordón Caulle is a complex volcano in Chile. The volcanic complex has shaped the local landscape and produced a huge variety of volcanic landforms and products over the last 300,000 years."
        },
        {
            "name": "Kikai",
            "vei": 7,
            "coordinates": [30.791719777149893, 130.30783192685274],
            "type": "Caldera",
            "summitFeet": 2310,
            "magmaType": "Rhyolite",
            "desc": "Kikai is a caldera in Japan. The Kikai-Akahoya eruption had a major impact on the Jōmon culture in southern Kyūshū although the impact was not as great as some commentary had suggested with Nishinozono sub-type pottery tradition, that had started prior to the eruption, maintained in Kyūshū."
        },
        {
            "name": "Valles Caldera",
            "vei": 7,
            "coordinates": [35.90299780929065, -106.5269137460628],
            "type": "Caldera",
            "summitFeet": 11253,
            "magmaType": "Rhyolite",
            "desc": "Valles is a caldera in the USA. The volcanic properties of Valles Caldera make it a likely source for renewable and nonpolluting geothermal energy."
        },
        {
            "name": "Kurile Lake",
            "vei": 7,
            "coordinates": [51.44962147398801, 157.10112052539006],
            "type": "Caldera",
            "summitFeet": 11253,
            "magmaType": "Rhyolite",
            "desc": "Kurile Lake is a caldera in Russia. The caldera forming eruption commenced with a phreatoplinian eruption that generated deposits of fine ash. Several yellowish rhyolitic ignimbrites were erupted, reaching a thickness of over 50 metres (160 ft)."
        },
        {
            "name": "Tambora",
            "vei": 7,
            "coordinates": [-8.247071593592436, 117.99167317157371],
            "type": "Stratovolcano",
            "summitFeet": 11253,
            "magmaType": "Rhyolite",
            "desc": "Tambora is a stratovolcano in Indonesia. The 1815 Tambora eruption is the largest and most devastating observed eruption in recorded history."
        },
        {
            "name": "Concepción",
            "vei": 5,
            "coordinates": [11.537359303350195, -85.6217795388534],
            "type": "Stratovolcano",
            "summitFeet": 11253,
            "magmaType": "Andesite",
            "desc": "Concepción is a stratovolcano in Nicaragua. It is considered a pristine volcano because there has been no influence of other volcanoes on its growth."
        },
        {
            "name": "Billy Mitchell",
            "vei": 6,
            "coordinates": [-6.090472989956283, 155.22562012078447],
            "type": "Caldera",
            "summitFeet": 5066,
            "magmaType": "Rhyolite",
            "desc": "Billy Mitchell is a caldera in Papua New Guinea. The last two major eruptions were in 1580 AD ± 20 years and about 1030 AD. They were among the largest Holocene eruptions in Papua New Guinea."
        },
        {
            "name": "Meager",
            "vei": 5,
            "coordinates": [50.631755185704556, -123.50436282691545],
            "type": "Complex",
            "summitFeet": 8793,
            "magmaType": "Andesite",
            "desc": "Meager is a complex volcano in Canada. The Mount Meager massif produced the largest volcanic eruption in Canada in the last 10,000 years."
        },
        {
            "name": "Atitlán",
            "vei": 8,
            "coordinates": [14.699846948775408, -91.19208510079145],
            "type": "Caldera",
            "summitFeet": 5125,
            "magmaType": "Rhyolite",
            "desc": "Atitlán is a caldera in Guatemala. During the Guatemalan Civil War (1960 - 1996), the lake was the scene of many terrible human rights abuses, as the government pursued a scorched earth policy."
        },
        {
            "name": "Cerro Galán",
            "vei": 8,
            "coordinates": [-25.916616416089713, -66.86984218325911],
            "type": "Caldera",
            "summitFeet": 20013,
            "magmaType": "Rhyolite",
            "desc": "Cerro Galán is a caldera in Argentina. Volcanic activity at Galán is the indirect consequence of the subduction of the Nazca Plate beneath the South America Plate, and involves the infiltration of melts into the crust and the formation of secondary magmas which after storage in the crust give rise to the dacitic to rhyodacitic rocks erupted by the volcano."
        },
        {
            "name": "Taranaki",
            "vei": 5,
            "coordinates": [-39.296634122772026, 174.06343858757384],
            "type": "Stratovolcano",
            "summitFeet": 8261,
            "magmaType": "Andesite",
            "desc": "Taranaki is a stratovolcano in New Zealand. According to Māori mythology, Taranaki once resided in the middle of the North Island, with all the other New Zealand volcanoes."
        },
        {
            "name": "Tristan da Cunha",
            "vei": 2,
            "coordinates": [-37.11170973507989, -12.288513551040712],
            "type": "Shield",
            "summitFeet": 6759,
            "magmaType": "Basalt",
            "desc": "Tristan da Cunha is a shield volcano in overseas UK. Tristan, and its neighbouring islands, lies about 400 km east of the Mid-Atlantic Ridge. The volcanic activity is unrelated to the Mid-Atlantic Ridge; rather, it is due to a hotspot."
        },
        {
            "name": "Avachinsky",
            "vei": 5,
            "coordinates": [53.255870113368466, 158.83332809874815],
            "type": "Stratovolcano",
            "summitFeet": 8914,
            "magmaType": "Andesite",
            "desc": "Avachinsky is a stratovolcano in Russia. Avachinsky lies on the Pacific Ring of Fire, at a point where the Pacific Plate is sliding underneath the Eurasian Plate at a rate of about 80 mm (3.1 in)/year."
        },
        {
            "name": "Shiveluch",
            "vei": 6,
            "coordinates": [56.6537554242363, 161.36313614440724],
            "type": "Stratovolcano",
            "summitFeet": 10771,
            "magmaType": "Andesite",
            "desc": "Shiveluch is a stratovolcano in Russia. Catastrophic eruptions took place in 1854 and 1964, when a large part of the lava dome collapsed and created a devastating debris avalanche."
        },
        {
            "name": "Flat Landing Brook Formation",
            "vei": 9,
            "coordinates": [47.38113, -65.87607],
            "type": "Caldera",
            "summitFeet": 640,
            "magmaType": "Rhyolite",
            "desc": ""
        },
        {
            "name": "Pastos Grandes",
            "vei": 8,
            "coordinates": [-21.690663136298543, -67.7717984191384],
            "type": "Caldera    ",
            "summitFeet": 19035,
            "magmaType": "Rhyolite",
            "desc": "Pastos Grandes is a caldera in Bolivia. Pastos Grandes was volcanically active for a long time, more than many other Altiplano-Puna volcanic complex centres."
        },
        {
            "name": "Siberian Traps",
            "vei": 10,
            "coordinates": [64.72728157307797, 88.02241020735606],
            "type": "Large Igneous Province",
            "summitFeet": 397,
            "magmaType": "Rhyolite",
            "desc": ""
        },
        {
            "name": "Caribbean Large Igneous Province",
            "vei": 10,
            "coordinates": [15.195956984413439, -69.72175985883337],
            "type": "Large Igneous Province",
            "summitFeet": 0,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "North Atlantic Igneous Province",
            "vei": 10,
            "coordinates": [56.141403108590026, -6.453498464751493],
            "type": "Large Igneous Province",
            "summitFeet": 0,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Paraná Traps",
            "vei": 10,
            "coordinates": [-28.41435327139424, -53.496368814964384],
            "type": "Large Igneous Province",
            "summitFeet": 1555,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Deccan Traps",
            "vei": 10,
            "coordinates": [18.99923403772129, 73.49983060020313],
            "type": "Large Igneous Province",
            "summitFeet": 846,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Emeishan Traps",
            "vei": 10,
            "coordinates": [28.56072737840973, 101.99739248116403],
            "type": "Large Igneous Province",
            "summitFeet": 9196,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Columbia River Basalt Group",
            "vei": 10,
            "coordinates": [47.45385337519675, -120.32508478314246],
            "type": "Large Igneous Province",
            "summitFeet": 2690,
            "magmaType": "Basalt",
            "desc": ""
        },
        {  
            "name": "Afro-Arabian Large Igneous Province",
            "vei": 10,
            "coordinates": [13.504615176535905, 41.825031130510375],
            "type": "Large Igneous Province",
            "summitFeet": 2937,
            "magmaType": "Basalt",
            "desc": ""
        },
        {  
            "name": "Gawler Range Large Igneous Province",
            "vei": 10,
            "coordinates": [-32.26311357901161, 137.32530261327827],
            "type": "Large Igneous Province",
            "summitFeet": 1500,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Karoo Ferrar Large Igneous Province",
            "vei": 10,
            "coordinates": [-29.345879461203985, 28.951795786857396],
            "type": "Large Igneous Province",
            "summitFeet": 8484,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Kerguelen Plateau",
            "vei": 10,
            "coordinates": [-52.93936184790187, 74.45159823957702],
            "type": "Large Igneous Province",
            "summitFeet": -6600,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Ahmeyim Great Dyke of Mauritania",
            "vei": 10,
            "coordinates": [20.811698483332737, -14.465005317066684],
            "type": "Large Igneous Province",
            "summitFeet": 2000,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Etna",
            "vei": 6,
            "coordinates": [37.75101806750681, 14.993433315138889],
            "type": "Stratovolcano",
            "summitFeet": 3357,
            "magmaType": "Basalt",
            "desc": "Mount Etna is an active stratovolcano on the east coast of Sicily, Italy, in the Metropolitan City of Catania, between the cities of Messina and Catania. It is located above the convergent plate margin between the African Plate and the Eurasian Plate. It is one of the tallest active volcanoes in Europe, and the tallest peak in Italy."
        },
        {
            "name": "Santorini",
            "vei": 7,
            "coordinates": [36.404329353287686, 25.396161397192543],
            "type": "Caldera",
            "summitFeet": 1204,
            "magmaType": "Rhyolite",
            "desc": "Santorini caldera is a large, mostly submerged caldera, located in the southern Aegean Sea, 120 kilometers north of Crete in Greece. Visible above water is the circular Santorini island group, consisting of Santorini (classic Greek Thera), the main island, Therasia and Aspronisi at the periphery, and the Kameni islands at the center. It has been designated a Decade Volcano. The huge Minoan eruption of Santorini in the 17th century BC may have inspired the legend of Atlantis. It was rated 7 in the Smithsonian Global Volcanism Program's Volcanic Explosivity Index."
        },
        {
            "name": "Teide",
            "vei": 6,
            "coordinates": [28.272329639902104, -16.64244571326994],
            "type": "Stratovolcano",
            "summitFeet": 12188,
            "magmaType": "Basalt",
            "desc": "Teide, or Mount Teide is a volcano on Tenerife in the Canary Islands, Spain. Its summit is the highest point in Spain and the highest point above sea level in the islands of the Atlantic. If measured from the ocean floor, its height of 7,500 m (24,600 ft) makes Teide the third-highest volcano in the world, and is described by UNESCO and NASA as Earth's third-tallest volcanic structure. Teide's elevation above sea level makes Tenerife the tenth highest island in the world."
        },
        {
            "name": "Nyiragongo",
            "vei": 2,
            "coordinates": [-1.5221945157799863, 29.249657029309112],
            "type": "Shield",
            "summitFeet": 11385,
            "magmaType": "Basalt",
            "desc": "Nyiragongo is a shield volcano in the DRC. Nyiragongo's lava lake has at times been the most voluminous known lava lake in recent history. The depth of the lava lake varies considerably."
        },
        {
            "name": "Stromboli",
            "vei": 3,
            "coordinates": [38.79215093655288, 15.212579655703337],
            "type": "Stratovolcano",
            "summitFeet": 3031,
            "magmaType": "Basalt",
            "desc": "Stromboli is a stratovolcano in Italy. Mount Stromboli has been in almost continuous eruption for the past 2,000–5,000 years; its last serious one occurred in 1921."
        },
        {
            "name": "Capelinhos",
            "vei": 2,
            "coordinates": [38.585269752532405, -28.714898784559765],
            "type": "Stratovolcano",
            "summitFeet": 1644,
            "magmaType": "Basalt",
            "desc": "Capelinhos is a stratovolcano in the Azores. The volcano is a landmark on Faial; its ruined lighthouse and Visitors Center (which lies along the cliff from the volcano) is a tourist destination."
        },
        {
            "name": "La Palma",
            "vei": 3,
            "coordinates": [28.575003971258365, -17.837753518335784],
            "type": "Stratovolcano",
            "summitFeet": 7959,
            "magmaType": "Basalt",
            "desc": "La Palma is a stratovolcano in the Canary Islands. Along with Tenerife, La Palma is the most volcanically active of the Canary Islands. Its base lies almost 4,000 m (13,123 ft) below sea level and reaches a height of 2,426 m (7,959 ft) above sea level."
        },
        {
            "name": "Damavand",
            "vei": 5,
            "coordinates": [35.95586670412353, 52.10961218268941],
            "type": "Stratovolcano",
            "summitFeet": 18602,
            "magmaType": "Basalt",
            "desc": "Damavand is a stratovolcano in Iran. Damavand is a significant mountain in Persian mythology. It is the symbol of Iranian resistance against despotism and foreign rule in Persian poetry and literature."
        },
        {
            "name": "Wolf",
            "vei": 4,
            "coordinates": [0.01698482999848532, -91.34246842207509],
            "type": "Shield",
            "summitFeet": 5610,
            "magmaType": "Basalt",
            "desc": "Wolf is a shield volcano in the Galapagos. The volcano was named after Theodor Wolf, a German geologist who studied the Galápagos Islands in the 19th century."
        },
        {
            "name": "Ulreung",
            "vei": 6,
            "coordinates": [37.50637977884061, 130.8571409616231],
            "type": "Stratovolcano",
            "summitFeet": 3228,
            "magmaType": "Basalt",
            "desc": "Ulreung is a stratovolcano in South Korea. Archaeological evidence indicates that the island has been inhabited since the 1st millennium BC."
        },
        {
            "name": "Ambrym",
            "vei": 6,
            "coordinates": [-16.249732773111884, 168.12720096985183],
            "type": "Shield",
            "summitFeet": 4377,
            "magmaType": "Basalt",
            "desc": "Ambrym is a volcano in Vanuatu. The western part of the island, comprising 17,605 ha of forest, together with gardens around habitation, has been recognised as an Important Bird Area (IBA) by BirdLife International because it supports populations of Vanuatu megapodes, Tanna fruit doves, red-bellied fruit doves, grey-eared honeyeaters, cardinal myzomelas, fan-tailed gerygones, long-tailed trillers, streaked fantails, Melanesian flycatchers, buff-bellied monarchs and Vanuatu white-eyes."
        },
        {  
            "name": "Opala",
            "vei": 7,
            "coordinates": [52.543088781102455, 157.33872616806227],
            "type": "Caldera",
            "summitFeet": 8002,
            "magmaType": "Andesite",
            "desc": "Opala is a caldera in Russia. It was formed 40,000 years ago from a VEI 7 eruption."
        },
        {  
            "name": "Mutnovsky",
            "vei": 3,
            "coordinates": [52.44899619654615, 158.1940689329932],
            "type": "Complex",
            "summitFeet": 7507,
            "magmaType": "Basalt",
            "desc": "Mutnovsky is a complex volcano in Russia. It is one of the most active volcanoes of southern Kamchatka; the latest eruption was recorded in 2000."
        },
        {  
            "name": "Grímsvötn",
            "vei": 6,
            "coordinates": [64.4168680572138, -17.32205248306599],
            "type": "Stratovolcano",
            "summitFeet": 5659,
            "magmaType": "Basalt",
            "desc": "Grímsvötn is an active volcano with a partially subglacial fissure system located in Vatnajökull National Park, Iceland. The volcano itself is completely subglacial and located under the northwestern side of the Vatnajökull ice cap. Grímsvötn is a basaltic volcano which has the highest eruption frequency of all the volcanoes in Iceland and has a southwest-northeast-trending fissure system. The massive climate-impacting Laki fissure eruption of 1783–1784 was a part of the same fissure system. Grímsvötn was erupting at the same time as Laki during 1783, but continued to erupt until 1785. Because most of the volcanic system lies underneath Vatnajökull, most of its eruptions have been subglacial and the interaction of magma and meltwater from the ice causes phreatomagmatic explosive activity.  "
        },
        {  
            "name": "Gambier",
            "vei": 4,
            "coordinates": [-37.84682318040542, 140.77712149929772],
            "type": "Complex",
            "summitFeet": 3317,
            "magmaType": "Basalt",
            "desc": "Mount Gambier is a volcano complex that sits right under the city of Mount Gambier, with a population of nearly 30 thousand people."
        },
        {  
            "name": "Changbaishan",
            "vei": 7,
            "coordinates": [42.00269704724275, 128.05850527551027],
            "type": "Stratovolcano",
            "summitFeet": 3317,
            "magmaType": "Basalt",
            "desc": "Changbaishan sits directly on the border between China and North Korea, and the crater in the center is a large lake called Heaven Lake."
        },
        {  
            "name": "Cameroon",
            "vei": 3,
            "coordinates": [4.216653826855627, 9.17408711018135],
            "type": "Stratovolcano",
            "summitFeet": 13419,
            "magmaType": "Basalt",
            "desc": "Mount Cameroon, one of Africa's largest volcanoes, sits near Douala, one of Cameroon's biggest cities. The view of the volcano is stunning, and if you look at a satellite image of Cameroon, you will surely notice it on the west coast of the country."
        },
        {
            "name": "Jan Mayen",
            "vei": 4,
            "coordinates": [71.08050039915567, -8.15698216489675],
            "type": "Stratovolcano",
            "summitFeet": 7208,
            "magmaType": "Basalt",
            "desc": "Jan Mayen is a rather isolated island in the Norwegian sea. On top of the island, a massive volcano with the same name sits. There are no permanent residents on the island."
        },
        {
            "name": "Bouvet",
            "vei": 0,
            "coordinates": [-54.42170775127812, 3.357629834534485],
            "type": "Shield",
            "summitFeet": 2431,
            "magmaType": "Basalt",
            "desc": "Bouvet Island, the island that Bouvet sits on, is one of the most isolated places on the planet, being 2,500 km away from any continent. There are no structures on the island."
        },
        {   "name": "Kirishima",
            "vei": 7,
            "coordinates": [31.916043194899036, 130.87903297379933],
            "type": "Complex",
            "summitFeet": 5600,
            "magmaType": "Andesite",
            "desc": "Kirishima is a volcano complex in Southern Japan. The highest peak is Karakuni-dake (1700 m). Its name literally means Korea Peak; it was once believed to be so high that the Korean Peninsula could be seen from its summit."
        },   
        {
            "name": "Štiavnica",
            "vei": 7,
            "coordinates": [48.40361366651884, 18.86666610976981],
            "type": "Caldera",
            "summitFeet": 3310,
            "magmaType": "Andesite",
            "desc": "Štiavnica is a caldera in Slovakia. From originally over 60 lakes called tajchy in Štiavnica Mountains, there are over 30 still existing today. Although they are now integrated in their natural environment, they were originally built as water reservoirs serving the mining industry, most of them in the 18th century."
        },
        {   "name": "Katla",
            "vei": 5,
            "coordinates": [63.646750348797774, -19.13055688844543],
            "type": "Stratovolcano",
            "summitFeet": 4961,
            "magmaType": "Basalt",
            "desc": "Katla is an active volcano in southern Iceland. This particular volcano has been very active historically with at least twenty documented major eruptions since 2920 BC. Katla is one of the largest volcanic sources of carbon dioxide (CO2) on Earth, accounting for up to 4% of total global volcanic carbon dioxide emissions. Katla is one of the largest volcanoes in Iceland."
        }, 
        {
            "name": "Ora Caldera",
            "vei": 8,
            "coordinates": [46.077196572770895, 11.151984143909631],
            "type": "Caldera",
            "summitFeet": 4429,
            "magmaType": "Rhyolite",
            "desc": "Ora Caldera is a Permian supervolcano situated within the Lower Alps of Italy, formed by a super eruption 275 million years ago."
        },
        {
            "name": "Altenberg-Teplice",
            "vei": 7,
            "coordinates": [50.70769615015468, 13.790283038935392],
            "type": "Caldera",
            "summitFeet": 4961,
            "magmaType": "Rhyolite",
            "desc": "Altenberg-Teplice is in a very odd location for a volcano, especially a strong one. The caldera was formed over 350 million years ago from a VEI 7 eruption."
        },
        {  
            "name": "Henry's Fork Caldera",
            "vei": 7,
            "coordinates": [44.329889203428465, -111.33016801227201],
            "type": "Caldera",
            "summitFeet": 9203,
            "magmaType": "Basalt",
            "desc": "Henry's Fork Caldera is a caldera in USA. The Henry's Fork caldera is in an area called Island Park, known for its beautiful forests, large springs, clear streams, waterfalls, lakes, ponds, marshes, wildlife, and fishing."
        },
        {
            "name": "Krakatoa",
            "vei": 6,
            "coordinates": [-6.1497044228515545, 105.44605798105464],
            "type": "Caldera",
            "summitFeet": 2667,
            "magmaType": "Rhyolite",
            "desc": "Famous volcano in Indonesia, which is theorized to have produced the loudest sound ever recorded."
        },
        {
            "name": "Pelée",
            "vei": 4,
            "coordinates": [14.811400131295668, -61.16590996774536],
            "type": "Stratovolcano",
            "summitFeet": 4583,
            "magmaType": "Andesite",
            "desc": "Volcano on Martinique, popular tourist destination"
        },
        {  
            "name": "Glen Coe",
            "vei": 8,
            "coordinates": [56.68242290543748, -5.101660449671116],
            "type": "Caldera",
            "summitFeet": 1620,
            "magmaType": "Andesite",
            "desc": "One of the best examples subsidence caldera, Glen Coe is a notable ancient volcano in the Scottish Highlands. Eruptions took place from about 400-450 million years ago in real life. It is an extinct volcano in real life."
        },
        {  
            "name": "Barren Island",
            "vei": 2,
            "coordinates": [12.28059401159717, 93.86262230264948],
            "type": "Stratovolcano",
            "summitFeet": 321,
            "magmaType": "Basalt",
            "desc": "An island of India, with a VEI 2 sitting on top. The island is popular among scuba divers."
        },
        { 
            "name": "Pagan",
            "vei": 4,
            "coordinates": [18.140086550093084, 145.78431038481546],
            "type": "Stratovolcano",
            "summitFeet": 570,
            "magmaType": "Basalt",
            "desc": "Pagan is an uninhabited island in the Northern Mariana Islands. It is a rather active volcano in real life, as it had eruptions in 1987, 1988, 1992, 1993, 1996, 2006, 2009, 2010, 2011, 2012, and 2021."
        },
        {  
            "name": "Kozushima",
            "vei": 4,
            "coordinates": [34.220219612122435, 139.1522614235979],
            "type": "Lava Dome",
            "summitFeet": 572,
            "magmaType": "Rhyolite",
            "desc": "Kozushima is a volcano off the coast of Japan near Tokyo, and the last major eruption was in 838 CE, being a VEI 4 eruption."
        },
        {
            "name": "Ulawun",
            "vei": 4,
            "coordinates": [-5.053646553162131, 151.33363338930013],
            "type": "Stratovolcano",
            "summitFeet": 2334,
            "magmaType": "Basalt",
            "desc": "Ulawun is a stratovolcano in Papua New Guinea. Because of its eruptive history and proximity to populated areas, Ulawun is considered one of the Decade Volcanoes." 
        },
        {
            "name": "Tongariro",
            "vei": 5,
            "coordinates": [-39.13064101262619, 175.6361138900971],
            "type": "Complex",
            "summitFeet": 1978,
            "magmaType": "Andesite",
            "desc": "Tongariro is a complex volcano in New Zealand. Mount Tongariro is in the Tongariro National Park, New Zealand's first national park and one of the earliest in the world." 
        },
        {  
            "name": "Sarychev Peak",
            "vei": 4,
            "coordinates": [48.092151909868115, 153.20199390554077],
            "type": "Stratovolcano",
            "summitFeet": 1496,
            "magmaType": "Andesite",
            "desc": "Sarychev Peak is a stratovolcano in the Kuril Islands. During an early stage of the eruption, on June 12, 2009, the International Space Station passed overhead and astronauts photographed the event." 
        },
        {  
            "name": "Bárðarbunga",
            "vei": 6,
            "coordinates": [64.63942013245467, -17.5257082572976],
            "type": "Stratovolcano",
            "summitFeet": 6562,
            "magmaType": "Andesite",
            "desc": "Bárðarbunga is a stratovolcano in Iceland. Bárðarbunga is named after an early Icelandic settler named Gnúpa-Bárður, and literally translates as Bárður's bulge or Bárður's bump since Bárðar is the genitive case of Bárður."
        },
        {
            "name": "Cerberean Caldera",
            "vei": 8,
            "coordinates": [-37.18819655305258, 145.9640398560064],
            "type": "Caldera",
            "summitFeet": 3000,
            "magmaType": "Andesite",
            "desc": "A Australian caldera that sits right below a national park. Some have theorized that the volcano erupted ~374 million years ago, and in part contributed to the Late Devonian extinction event."
        },
        {
            "name": "High Island Caldera",
            "vei": 8,
            "coordinates": [22.356567897377662, 114.35183562918452],
            "type": "Caldera",
            "summitFeet": 6562,
            "magmaType": "Tuff",
            "desc": "An interesting caldera that is situated on High Island of Hong Kong. Not much is known about the volcano, though evidence suggests that it's last eruption was 140 million years ago, releasing enough ash to cover the entirety of Hong Kong."
        },
        {  
            "name": "Ōkueyama",
            "vei": 8,
            "coordinates": [32.736458250426544, 131.50838026858838],
            "type": "Stratovolcano",
            "summitFeet": 5390,
            "magmaType": "Andesite?",
            "desc": "Mount Ōkueyama is among one of Japan's largest volcanoes. It last erupted 13.7 million years ago, which would've been a VEI 8. However, the volcano is now considered extinct IRL."
        },
        {
            "name": "Broken Top",
            "vei": 0,
            "coordinates": [44.0832499246262, -121.6996182636665],
            "type": "Stratovolcano",
            "summitFeet": 9177,
            "magmaType": "Basalt",
            "desc": "Broken Top is a stratovolcano in the USA. In total, throughout its 150,000 years of eruptive activity, Broken Top erupted between 1.7 to 2.4 cubic miles (7 to 10 km3) of lava."
        },
        {
            "name": "Whakaari",
            "vei": 2,
            "coordinates": [-37.520787614465576, 177.1833178535319],
            "type": "Stratovolcano",
            "summitFeet": 1053,
            "magmaType": "Andesite",
            "desc": "Whakaari is an active stratovolcano in New Zealand. Some Māori myths describe Whakaari as part of Ngātoro-i-rangi's ascent of Tongariro. In one account, he called on his ancestors for warmth; the fire was kindled on Whakaari and brought to him."
        },
        {
            "name": "Ascension Island",
            "vei": 0,
            "coordinates": [-7.951423345586253, -14.348340883267173],
            "type": "Stratovolcano",
            "summitFeet": 2815,
            "magmaType": "Basalt",
            "desc": "Ascension Island is a stratovolcano in the UK. Ascension is considered active and could have erupted as recently as 500 years ago, but the exact eruption date is elusive."
        },
        {
            "name": "Hoodoo Mountain",
            "vei": 0,
            "coordinates": [56.77028744476555, -131.2814216303202],
            "type": "Stratovolcano",
            "summitFeet": 6070,
            "magmaType": "Phonolite",
            "desc": "Hoodoo Mountain is a stratovolcano in Canada. The Hoodoo Mountain area contains several large mining camps within the floodplain of the Iskut River. Prospecting in Bronson Creek commenced as early as 1907, during which time several mining claims had been staked. This was followed by drifting, trenching and stripping of several gold-bearing veins between 1910 and 1920."
        },
        {
            "name": "Axial Seamount",
            "vei": 0,
            "coordinates": [46.059893676698486, -130.00006698999405],
            "type": "Fissure vent",
            "summitFeet": -4626,
            "magmaType": "Basalt",
            "desc": "Axial Seamount is a submarine volcano in the US. This position is not yet entirely understood. It is believed that the chain, formed over millions of years by the now-inactive Cobb hotspot, is older than the mid-ocean ridge it bisects. Between 200,000 and 700,000 years ago, the hotspot was encroached by the tectonic spreading center, displacing it by as much as 20 km (12 mi) and building up the 500 km (311 mi) long Juan de Fuca Ridge."
        },
        {
            "name": "Morne Watt",
            "vei": 2,
            "coordinates": [15.3164492983203, -61.299923810920255],
            "type": "Stratovolcano",
            "summitFeet": 4016,
            "magmaType": "Andesite",
            "desc": "Morne Watt is a stratovolcano in Dominica. The mountain is home to the Boiling Lake and Valley of Desolation thermal areas, both of which are the best-known volcanic features in Dominica and major tourist attractions in Morne Trois Pitons National Park."
        },
        {
            "name": "The Quill",
            "vei": 4,
            "coordinates": [17.478132472127193, -62.96171968567863],
            "type": "Stratovolcano",
            "summitFeet": 1972,
            "magmaType": "Andesite",
            "desc": "The Quill is a stratovolcano in the Netherlands overseas territory Sint Eustatius. The crater of The Quill contains a lush rainforest populated by native and introduced tropical trees and plants."
        },
        {
            "name": "Liamuiga",
            "vei": 4,
            "coordinates": [17.371322053481048, -62.807799771133205],
            "type": "Stratovolcano",
            "summitFeet": 3793,
            "magmaType": "Andesite",
            "desc": "Liamuiga is a stratovolcano in Saint Kitts and Nevis. Mount Liamuiga was formerly named Mount Misery."
        },
        {
            "name": "Soufrière Hills",
            "vei": 3,
            "coordinates": [16.71042968137563, -62.17570687350091],
            "type": "Stratovolcano",
            "summitFeet": 5066,
            "magmaType": "Andesite",
            "desc": "Soufrière Hills is a stratovolcano in the UK overseas territory Montserrat. Its eruptions have rendered more than half of Montserrat uninhabitable, destroying the capital city, Plymouth, and causing widespread evacuations: about two-thirds of the population have left the island."
        },
        {
            "name": "Kick 'em Jenny",
            "vei": 1,
            "coordinates": [12.299992283130464, -61.6400094655348],
            "type": "Complex",
            "summitFeet": -607,
            "magmaType": "Basalt",
            "desc": "Kick 'em Jenny is a complex submarine volcano in the Caribbean. The name itself may be a reference to the waters sometimes being extremely rough. "
        },
        {
            "name": "Galeras",
            "vei": 6,
            "coordinates": [1.221300208496533, -77.35849982974266],
            "type": "Complex",
            "summitFeet": 14029,
            "magmaType": "Andesite",
            "desc": "Galeras is a complex volcano in Colombia. Galeras has been an active volcano for at least a million years, with andesite as the dominant product."
        },
        {
            "name": "Reventador",
            "vei": 4,
            "coordinates": [-0.0777589817541093, -77.65637055258881],
            "type": "Stratovolcano",
            "summitFeet": 11686,
            "magmaType": "Andesite",
            "desc": "Reventador is a stratovolcano in Ecuador. In 2020, there were near daily emissions of clouds of ash rising one or two kilometres into the air, occasional crater incandescence, and frequent avalanches of incandescent blocks."
        },
        {
            "name": "Cerro Azul",
            "vei": 3,
            "coordinates": [-0.9298955523096094, -91.3922924796756],
            "type": "Stratovolcano",
            "summitFeet": 11686,
            "magmaType": "Andesite",
            "desc": "Cerro Azul is a stratovolcano in the Galapagos. A study published in 2006 showed that there was continuous expansion of the volcano prior to and after the eruption in 1998."
        },
        {
            "name": "Huaynaputina",
            "vei": 6,
            "coordinates": [-16.61269340254413, -70.85279262543337],
            "type": "Stratovolcano",
            "summitFeet": 15531,
            "magmaType": "Dacite",
            "desc": "Huaynaputina is a stratovolcano in Peru. During the wet season, mudflows often descend from Huaynaputina."
        },
        {
            "name": "El Misti",
            "vei": 5,
            "coordinates": [-16.29903575980277, -71.40538863089],
            "type": "Stratovolcano",
            "summitFeet": 19101,
            "magmaType": "Andesite",
            "desc": "El Misti is a stratovolcano in Peru. The Aymara people viewed it as an abode of deceased souls."
        },
        {
            "name": "Colo",
            "vei": 4,
            "coordinates": [-0.17046963237026386, 121.60698433650492],
            "type": "Stratovolcano",
            "summitFeet": 1325,
            "magmaType": "Basalt",
            "desc": "Colo is a stratovolcano in Indonesia. Only three eruptions have been recorded in the history with two of them causing damage."
        },
        {
            "name": "Lokon-Empung",
            "vei": 3,
            "coordinates": [1.3648484434138346, 124.79934936773321],
            "type": "Stratovolcano",
            "summitFeet": 5184,
            "magmaType": "Basalt",
            "desc": "Lokon-Empung is a stratovolcano in Indonesia. Historical eruptions have been reported since 1375."
        },
        {
            "name": "Ciomadul",
            "vei": 4,
            "coordinates": [46.136294541384366, 25.887587358534958],
            "type": "Lava Dome",
            "summitFeet": 4229,
            "magmaType": "Dacite",
            "desc": "Ciomadul had many explosive eruptions from 56,000-32,000 years ago, and some ash is theorized to have reached as far as the Black Sea during these eruptions. Because of this, it has the most recent volcanic activity in Europe (excluding Greece and Italy)."
        },
        {
            "name": "Dacht-i-Navar Group",
            "vei": 6,
            "coordinates": [33.947709742293625, 67.91062153441177],
            "type": "Complex",
            "summitFeet": 13251,
            "magmaType": "Andesite",
            "desc": "Dacht-i-Navar Group is a complex volcano in Afghanistan. Dacht-i-Navar is considered to be the source of volcanic ash layers found in the Sivalik Hills that were erupted 2.31 ± 0.84 to 2.8 ± 0.56 million years ago."
        },
        {  
            "name": "Puracé",
            "vei": 3,
            "coordinates": [2.3129405320191805, -76.3948688272389],
            "type": "Stratovolcano",
            "summitFeet": 15256,
            "magmaType": "Andesite",
            "desc": "Puracé is a stratovolcano in Colombia. It is one of the most active volcanoes in Colombia."
        },
        {
            "name": "Sabancaya",
            "vei": 3,
            "coordinates": [-15.785576644157599, -71.85667556567306],
            "type": "Stratovolcano",
            "summitFeet": 19554,
            "magmaType": "Andesite",
            "desc": "Sabancaya is a stratovolcano in Peru. The basement of the volcano is formed by Precambrian rocks of the Arequipa Massif, which are up to 1.9 billion years old."
        },
        {
            "name": "Yucamane",
            "vei": 5,
            "coordinates": [-17.183030970768048, -70.19888917571083],
            "type": "Stratovolcano",
            "summitFeet": 18028,
            "magmaType": "Andesite",
            "desc": "Yucamane is a stratovolcano in Peru. Yucamane is fumarolically active in its summit crater, the fumaroles are most recognizable after precipitation and are not very intense."
        },
        {  
            "name": "Cerro Blanco",
            "vei": 7,
            "coordinates": [-26.772172309571122, -67.72033396610941],
            "type": "Caldera",
            "summitFeet": 15322,
            "magmaType": "Rhyolite",
            "desc": "Cerro Blanco is a caldera in Argentina. Cerro Blanco received attention from scientists after satellite images in the early 21st century observed deflation of the caldera."
        },    
        {
            "name": "Toussidé",
            "vei": 7,
            "coordinates": [21.04105755916579, 16.465801203178874],
            "type": "Stratovolcano",
            "summitFeet": 5226,
            "magmaType": "Rhyolite",
            "desc": "Tarso Toussidé is a stratovolcano in Chad. Toussidé is among the youngest volcanoes in Tibesti, and may have erupted in historical time."
        },
        {
            "name": "Fisher",
            "vei": 6,
            "coordinates": [54.66830523979994, -164.36399394760758],
            "type": "Stratovolcano",
            "summitFeet": 3648,
            "magmaType": "Andesite",
            "desc": "Fisher is a caldera in the Aleutian Islands. Historical eruptions have occurred in the 18th and 19th centuries."
        },
        {
            "name": "Michoacán-Guanajuato",
            "vei": 4,
            "coordinates": [19.49281093711586, -102.25122418261726],
            "type": "Volcanic Field",
            "summitFeet": 12664,
            "magmaType": "Andesite",
            "desc": "Michoacán-Guanajuato is a volcanic field in Mexico. The volcanic field is best known for the 18th-century eruption of Jorullo volcano, and 20th-century eruption of Parícutin volcano."
        },
        {
            "name": "Arenal",
            "vei": 4,
            "coordinates": [10.462280295754208, -84.70277585347391],
            "type": "Stratovolcano",
            "summitFeet": 5479,
            "magmaType": "Andesite",
            "desc": "Arenal is a stratovolcano in Costa Rica. Arenal is one of seven historically active Costa Rican volcanoes along with Poás, Irazú, Miravalles, Orosí, Rincón de la Vieja complex, and Turrialba."
        },
        {
            "name": "Udokan Plateau",
            "vei": 3,
            "coordinates": [57.08215725769283, 119.79913175683569],
            "type": "Volcanic Field",
            "summitFeet": 7150,
            "magmaType": "Basalt",
            "desc": "Udokan Plateau is a massive volcanic field in the Russian far east. Volcanism in the Udokan Plateau included both basaltic lava flows and later individual volcanic cones."
        },
        {
            "name": "Chaîne des Puys",
            "vei": 6,
            "coordinates": [45.77403438423006, 2.9590687261047885],
            "type": "Lava Dome",
            "summitFeet": 4803,
            "magmaType": "Basalt",
            "desc": "Chaîne des Puys is a chain of cinder cones, lava domes and maars in the Massif Central in France.The chain is about 40 km (25 mi) long, and the identified volcanic features, which constitute a volcanic field,include 48 cinder cones, eight lava domes, and 15 maars and explosion craters."
        },
        {
            "name": "East Eifel Volcanic Field",
            "vei": 6,
            "coordinates": [50.41341207835856, 7.269100837839249],
            "type": "Volcanic Field",
            "summitFeet": 1929,
            "magmaType": "Rhyolite?",
            "desc": "East Eifel Volcanic Field is a volcanic field in Germany that mostly consists of crater lakes and maars. The largest eruption in this volcanic field happened 12,900 years ago at Laacher See and was classified as a 6 on the VEI scale."
        },
        {
            "name": "Eldvörp–Svartsengi",
            "vei": 4,
            "coordinates": [63.82032260432834, -22.689947191202187],
            "type": "Crater Rows",
            "summitFeet": 305,
            "magmaType": "Basalt",
            "desc": "The Eldvörp–Svartsengi volcanic system comprises a broad area of postglacial basaltic crater rows and small shield volcanoes."
        },
        {
            "name": "Fueguino",
            "vei": 2,
            "coordinates": [-54.9618927840529, -70.26183213611331],
            "type": "Lava Dome",
            "summitFeet": 515,
            "magmaType": "Andesite",
            "desc": "Fueguino is a lava dome located on Isla Cook. It is the southernmost holocene volcano in South America."
        },
        {
            "name": "Crater Basalt",
            "vei": 1,
            "coordinates": [-42.01921432180831, -70.19110484309512],
            "type": "Volcanic Field",
            "summitFeet": 4409,
            "magmaType": "Basalt",
            "desc": "Crater Basalt is a volcanic field in Argentina. It consists of 9 cinder and spatter cones."
        },
        {
            "name": "Lake Tōya",
            "vei": 7,
            "coordinates": [42.601958496448326, 140.8503902952169],
            "type": "Caldera",
            "summitFeet": 2405,
            "magmaType": "Andesite",
            "desc": "Lake Tōya is a 10 kilometer wide caldera in Hokkaido, Japan. It had a single caldera forming VEI 7 eruption 110,000 years ago."
        },
        {
            "name": "Adams Seamount",
            "vei": 0,
            "coordinates": [-25.362755789869983, -129.26517996047232],
            "type": "Lava Dome",
            "summitFeet": -128,
            "magmaType": "Basalt",
            "desc": "Adams Seamount is a submarine volcano in the Pacific Ocean. Given its height, during the last glacial maximum Adams was likely an island."
        },
        {
            "name": "Adatarayama",
            "vei": 3,
            "coordinates": [37.62110735726349, 140.28787837035807],
            "type": "Stratovolcano",
            "summitFeet": 5669,
            "magmaType": "Andesite",
            "desc": "Adatarayama is a stratovolcano in Japan. Historical eruptions have been restricted to the 1.2-km-wide, 350-m-deep Numonotaira crater."
        },
        {
            "name": "Semisopochnoi",
            "vei": 7,
            "coordinates": [51.94563595497955, 179.60776382301856],
            "type": "Caldera",
            "summitFeet": 4006,
            "magmaType": "Basalt",
            "desc": "Semisopochnoi is a volcanic island in the Rat Islands. A huge VEI 7 eruption occured in the Holocene, forming a 8 kilometer wide caldera."
        },
        {
            "name": "Strechovy",
            "vei": 4,
            "coordinates": [48.78122522803923, 21.593920289227515],
            "type": "Stratovolcano?",
            "summitFeet": 2600,
            "magmaType": "Andesite",
            "desc": "Strechovy is a part of a volcanic chain in Slovakia called Slanské vrchy. It has produced over 100 explosive eruptions in its lifetime."
        },
        {
            "name": "Buzzard Creek",
            "vei": 2,
            "coordinates": [64.06187893697235, -148.43197535956944],
            "type": "Tuff Rings",
            "summitFeet": 2723,
            "magmaType": "Basalt",
            "desc": "Two Holocene tuff rings form craters 300 and 66m wide near the headwaters of Buzzard Creek. The total volume of ejecta, most of which is accessory material, probably does not exceed 0.001 km3."
        },
        {
            "name": "Jebel Marra",
            "vei": 4,
            "coordinates": [12.952337669857398, 24.26236323628537],
            "type": "Volcanic Field",
            "summitFeet": 9980,
            "magmaType": "Basalt",
            "desc": "Jebel Marra is a volcanic field in Sudan. It's largest eruption happened 4,000 years ago at Deriba Caldera and has been rated as a 4 on the VEI scale."
        },
        {
            "name": "Meidob Volcanic Field",
            "vei": 4,
            "coordinates": [15.303414368398778, 26.430201210485034],
            "type": "Volcanic Field",
            "summitFeet": 6562,
            "magmaType": "Basalt",
            "desc": "Meidob is a volcanic field in Sudan. It has produced 4 VEI 4 eruptions in 3,000 years. "
        },
        {
            "name": "Menengai",
            "vei": 6,
            "coordinates": [-0.20182471405821364, 36.0752619656571],
            "type": "Shield",
            "summitFeet": 7474,
            "magmaType": "Basalt",
            "desc": "Menengai is a huge shield volcano in Kenya. Around 8,000 years ago it produced a huge caldera forming eruption, rated as a 6 on the VEI scale."
        },
        {
            "name": "Nabro",
            "vei": 6,
            "coordinates": [13.356837325375624, 41.67608429960259],
            "type": "Caldera",
            "summitFeet": 7277,
            "magmaType": "Rhyolite",
            "desc": "Nabro is a caldera complex in Eritrea. The twin calderas likely formed during an eruption of about 20 to 100 cubic kilometres consisting of ignimbrite, although the date of their formation is unknown."
        },
        {
            "name": "Karthala",
            "vei": 3,
            "coordinates": [-11.765070953384653, 43.36751678153547],
            "type": "Shield",
            "summitFeet": 7746,
            "magmaType": "Basalt",
            "desc": "Karthala is an active shield volcano in the Comoros. More than twenty eruptions have been recorded since the 19th century from the summit caldera and vents on the N and S flanks."
        },
        {
            "name": "Igwisi Hills",
            "vei": 2,
            "coordinates": [-4.870610659048967, 31.919797539746394],
            "type": "Volcanic Field",
            "summitFeet": 3760,
            "magmaType": "Kimberlite",
            "desc": "Igwisi Hills are a volcanic field in Tanzania. The Igwisi Hills are the only places in the world where possible kimberlite lava flows have been found, in form of calcite-olivine lavas."
        },
        {
            "name": "Ngozi",
            "vei": 5,
            "coordinates": [-9.004656235205506, 33.5549234024922],
            "type": "Caldera",
            "summitFeet": 8576,
            "magmaType": "Phonolite",
            "desc": "Ngozi is a caldera in Tanzania. There are a number of local myths and folk tales which surround the volcanic lake, and the surrounding area."
        },
        {
            "name": "Ol Doinyo Lengai",
            "vei": 3,
            "coordinates": [-2.7650623565631784, 35.917577621430056],
            "type": "Stratovolcano",
            "summitFeet": 9718,
            "magmaType": "Phonolite",
            "desc": "Ol Doinyo Lengai is a stratovolcano in Tanzania. The Maasai and Sonjo people refer to the volcano as The Mountain of God, viewing it as the abode of the god Engai, who withdrew there after being hit by a hunter with an arrow."
        },
        {
            "name": "Maipo",
            "vei": 7,
            "coordinates": [-34.168291909826735, -69.82576352345342],
            "type": "Stratovolcano",
            "summitFeet": 17270,
            "magmaType": "Rhyolite",
            "desc": "Maipo is a stratovolcano on the Chile-Argentina border. It is located within a 16 x 20km Diamante Caldera which produced a VEI 7 eruption 450,000 years ago."
        },
        {
            "name": "Lake Maninjau",
            "vei": 7,
            "coordinates": [-0.315876408474245, 100.18266616642448],
            "type": "Caldera",
            "summitFeet": 1506,
            "magmaType": "Rhyolite",
            "desc": "Maninjau is a caldera lake in Sumatra, Indonesia. It is a notable tourist destination in the region due to its scenery and mild climate. It is also a site for paragliding."
        },
        {
            "name": "Agrigan",
            "vei": 4,
            "coordinates": [18.773359958479393, 145.6671228276175],
            "type": "Stratovolcano",
            "summitFeet": 3166,
            "magmaType": "Andesite?",
            "desc": "Agrigan is a volcanic island in the Marianas. It is the highest volcano in the Marianas arc."
        },
        {
            "name": "Agung",
            "vei": 5,
            "coordinates": [-8.344159488928387, 115.50800157996585],
            "type": "Stratovolcano",
            "summitFeet": 9833,
            "magmaType": "Andesite",
            "desc": "Agung is a stratovolcano in Indonesia. Balinese people believe that Mount Agung is a replica of Mount Meru, the central axis of the universe."
        },
        {
            "name": "Ahyi",
            "vei": 2,
            "coordinates": [20.418342908472216, 145.01966254667047],
            "type": "Stratovolcano",
            "summitFeet": -246,
            "magmaType": "Basalt?",
            "desc": "Ahyi is a submarine volcano in the Marianas. On 24-25 April 2001 an explosive eruption was detected seismically by a station on Rangiroa Atoll, Tuamotu Archipelago."
        },
        {
            "name": "Alcedo",
            "vei": 5,
            "coordinates": [-0.42472732158818755, -91.11676598864507],
            "type": "Shield",
            "summitFeet": 3710,
            "magmaType": "Rhyolite",
            "desc": "Alcedo is a shield volcano in the Galapagos. It is the only volcano in the Galapagos to have erupted Rhyolite lavas. Approximately 1 km3 of Rhyolite was erupted in total."
        },
        {
            "name": "Ambae",
            "vei": 3,
            "coordinates": [-15.392851541670622, 167.82987705773618],
            "type": "Shield",
            "summitFeet": 4908,
            "magmaType": "Basalt",
            "desc": "Ambae is a shield volcano in the Vanuatu. The latest known flank eruption, about 300 years ago, destroyed the population of the Nduindui area near the western coast."
        },
        {
            "name": "Bamus",
            "vei": 3,
            "coordinates": [-5.196918421437664, 151.23306209694886],
            "type": "Stratovolcano",
            "summitFeet": 7375,
            "magmaType": "Andesite",
            "desc": "Bamus is a stratovolcano in Papua New Guinea. Young pyroclastic-flow deposits are found on the volcano's flanks, and villagers describe an eruption that took place during the late 19th century."
        },
        {
            "name": "Carrán-Los Venados",
            "vei": 4,
            "coordinates": [-40.308882597506354, -72.06978546567298],
            "type": "Pyroclastic Cones",
            "summitFeet": 3655,
            "magmaType": "Andesite",
            "desc": "Carrán-Los Venados is a volcano group in Chile. The volcanic features occupy a low-lying area N of the more topographically prominent Puyehue-Cordón Caulle volcanic chain, and many of the vents are postglacial in age."
        },
        {
            "name": "Curacoa",
            "vei": 3,
            "coordinates": [-15.621932877322982, -173.6634245533308],
            "type": "Complex",
            "summitFeet": -108,
            "magmaType": "Basalt?",
            "desc": "Curacoa is a submarine complex volcano in Tonga. Explosive eruptions, which produced large rafts of dacitic pumice, covering an area of more than 100 km2, were observed from the island of Tafahi, 27 km SSW."
        },
        {
            "name": "Darwin",
            "vei": 2,
            "coordinates": [-0.19551676561074952, -91.28300172660728],
            "type": "Shield",
            "summitFeet": 4364,
            "magmaType": "Basalt?",
            "desc": "Darwin is a shield volcano in the Galapagos. This prominent tuff cone and its neighbor Beagle (also breached to the south) are located on the SW-flank coastline and were a prominent part of Darwin's geological studies in the Galápagos Islands."
        },
        {
            "name": "Pico do Fogo",
            "vei": 2,
            "coordinates": [14.949399719381917, -24.34060471911341],
            "type": "Stratovolcano",
            "summitFeet": 9281,
            "magmaType": "Basalt",
            "desc": "Pico do Fogo is a stratovolcano in the Cabo Verde. The roughly circular 25-km-wide island is truncated by a large 9-km-wide caldera that is breached to the east and has a headwall 1 km high."
        },
        {
            "name": "Garibaldi",
            "vei": 3,
            "coordinates": [49.84882426271085, -123.00001046024853],
            "type": "Stratovolcano",
            "summitFeet": 8786,
            "magmaType": "Dacite",
            "desc": "Garibaldi is a stratovolcano in Canada. Mount Garibaldi is considered sacred to the Squamish people as it is an important part of their history."
        },
        {
            "name": "Edziza",
            "vei": 3,
            "coordinates": [57.71305127271887, -130.6363066624905],
            "type": "Stratovolcano",
            "summitFeet": 9140,
            "magmaType": "Basalt",
            "desc": "Edziza is a stratovolcano in Canada. In prehistoric times, Edziza was a significant source of obsidian for the Tahltan people."
        },
        {
            "name": "Bennett Lake Volcanic Complex",
            "vei": 7,
            "coordinates": [60.02499283364788, -135.32039685720034],
            "type": "Caldera",
            "summitFeet": 4921,
            "magmaType": "Rhyolite",
            "desc": "Bennett Lake Volcanic Complex is a huge caldera in Canada. Cataclysmic eruptions from the Bennett Lake Volcanic Complex were from vents along arcuate fracture systems that ejected out about 850 km3 (200 cu mi) of glowing avalanches of pyroclastic rock called pyroclastic flows."
        },
        {
            "name": "Mount Churchill",
            "vei": 6,
            "coordinates": [61.41564775683661, -141.70658410864343],
            "type": "Stratovolcano",
            "summitFeet": 16421,
            "magmaType": "Dacite",
            "desc": "Churchill is a stratovolcano in Alaska. Mount Churchill is the source of two of the largest volcanic eruptions of the past two millennia in North America."
        },
        {
            "name": "Los Humeros",
            "vei": 7,
            "coordinates": [19.683254505003536, -97.45001909028083],
            "type": "Caldera",
            "summitFeet": 10335,
            "magmaType": "Rhyolite",
            "desc": "Los Humeros is a giant caldera in Mexico. The first major silicic eruption produced the 230 km3 Xáltipan Ignimbrite about 460,000 years before present, which covered about 3500 km2 and resulted in formation of the 15 x 21 km Los Humeros caldera."
        },
        {
            "name": "El Metate",
            "vei": 5,
            "coordinates": [19.537635846844164, -101.9920910504119],
            "type": "Shield",
            "summitFeet": 8000,
            "magmaType": "Andesite",
            "desc": "El Metate is a shield volcano in Mexico. It had a single VEI 5 eruption in 1250 AD."
        },
        {
            "name": "Lvinaya Past",
            "vei": 7,
            "coordinates": [44.610847592026985, 146.98984155058724],
            "type": "Caldera",
            "summitFeet": 1732,
            "magmaType": "Dacite",
            "desc": "Lvinaya Past is a huge caldera in the Kuril Islands. It produced one of the largest Holocene eruptions."
        },
        {
            "name": "Medvezhya",
            "vei": 7,
            "coordinates": [45.38793455163856, 148.82960820303654],
            "type": "Caldera",
            "summitFeet": 3688,
            "magmaType": "Rhyolite",
            "desc": "Medvezhya is a caldera in the Kuril Islands. It produced only a single VEI 7 eruption."
        },
        {
            "name": "Tao-Rusyr Caldera",
            "vei": 6,
            "coordinates": [49.3504702968679, 154.7201500480497],
            "type": "Caldera",
            "summitFeet": 4347,
            "magmaType": "Andesite",
            "desc": "Tao-Rusyr is a caldera in the Kuril Islands. The caldera forming eruption wiped out vegetation on southern Onekotan, and it took a long time for it to recover."
        },
        {
            "name": "Uzon",
            "vei": 6,
            "coordinates": [54.51086850817863, 159.91564139327346],
            "type": "Caldera",
            "summitFeet": 5305,
            "magmaType": "Rhyolite",
            "desc": "Uzon is a caldera in Russia. Together with Geyzernaya caldera it erupted over 25 km3 of ignimbrite in mid-Pleistocene."
        },
        {
            "name": "Scafells",
            "vei": 7,
            "coordinates": [54.452407457851585, -3.1947587751498627],
            "type": "Caldera",
            "summitFeet": 3209,
            "magmaType": "Dacite",
            "desc": "Scafells is a caldera in mainland UK. It had a singular VEI 7 eruption over 400 million years ago."
        },
        {
            "name": "Morne Diablotins",
            "vei": 6,
            "coordinates": [15.499615592696562, -61.400307611241686],
            "type": "Stratovolcano",
            "summitFeet": 4747,
            "magmaType": "Andesite",
            "desc": "Morne Diablotins is a stratovolcano in the Dominica. No recent eruptions are known, although numerous hot springs, both onshore and submarine, are found near Glanvillia, on the NW flank."
        },
        {
            "name": "Nemrut Dağı",
            "vei": 6,
            "coordinates": [38.62266072511571, 42.22790151787258],
            "type": "Caldera",
            "summitFeet": 9672,
            "magmaType": "Rhyolite",
            "desc": "Nemrut is a caldera in Türkiye. The volcano is named after King Nimrod who is said to have ruled this area in about 2100 BC."
        },
        {
            "name": "Sturgeon Lake Caldera",
            "vei": 6,
            "coordinates": [49.87081566059369, -91.00278650011829],
            "type": "Caldera",
            "summitFeet": 1493,
            "magmaType": "Rhyolite",
            "desc": "Sturgeon Lake Caldera is a caldera in Ontario, Canada. It is one of the oldest volcanoes being formed approximately 2.7 billion years ago."
        },
        {
            "name": "Erciyes Dağı",
            "vei": 7,
            "coordinates": [38.53135537511888, 35.44664797050198],
            "type": "Stratovolcano",
            "summitFeet": 12851,
            "magmaType": "Andesite",
            "desc": "Erciyes is a stratovolcano in Türkiye. It is one of the strongest volcanoes in Türkiye with one of the eruptions ejecting 146 km3 of tephra."
        },
        {
            "name": "Acıgöl–Nevşehir",
            "vei": 6,
            "coordinates": [38.540956274299184, 34.62056126041784],
            "type": "Caldera",
            "summitFeet": 5522,
            "magmaType": "Rhyolite",
            "desc": "Acıgöl–Nevşehir is a caldera located in Türkiye. There is little information about this volcano besides 2 confirmed VEI 6 eruptions."
        },
        {
            "name": "Hasan Dağı",
            "vei": 4,
            "coordinates": [38.125838828188805, 34.16229403687613],
            "type": "Caldera",
            "summitFeet": 10722,
            "magmaType": "Andesite",
            "desc": "Hasan is a stratovolcano in Türkiye. The Byzantine city of Mokissos was located on Mount Hasan."
        },
        {
            "name": "Kula",
            "vei": 5,
            "coordinates": [38.57593270393584, 28.549320763037677],
            "type": "Volcanic Field",
            "summitFeet": 2460,
            "magmaType": "Basalt",
            "desc": "Kula is a volcanic field located in Türkiye. The area is a geopark recognized by UNESCO given the universal and scientific value."
        },
        {
            "name": "Ararat",
            "vei": 3,
            "coordinates": [39.70912236612427, 44.29205849870242],
            "type": "Stratovolcano",
            "summitFeet": 16854,
            "magmaType": "Andesite",
            "desc": "Ararat is a stratovolcano in Türkiye. Ararat is known as the holy mountain of the Armenian people."
        },
        {
            "name": "Ghegam Ridge",
            "vei": 3,
            "coordinates": [40.262735170368465, 44.99010954372005],
            "type": "Volcanic Field",
            "summitFeet": 11801,
            "magmaType": "Rhyolite",
            "desc": "Ghegam Ridge is a volcanic field in Armenia."
        },
        {
            "name": "Ranau",
            "vei": 7,
            "coordinates": [-4.86594264343756, 103.91918874803888],
            "type": "Caldera",
            "summitFeet": 6083,
            "magmaType": "Rhyolite",
            "desc": "Ranau is a caldera in Indonesia. It formed around 550,000 years ago in a VEI 7 eruption."
        },
        {
            "name": "Tondano Caldera",
            "vei": 7,
            "coordinates": [1.2404257740091773, 124.90923265187756],
            "type": "Caldera",
            "summitFeet": 3944,
            "magmaType": "Rhyolite",
            "desc": "Tondao is a caldera in Indonesia. It produced the strongest VEI 7 eruption in Indonesia."
        },
        {
            "name": "Colli Albani",
            "vei": 7,
            "coordinates": [41.740191691371635, 12.722042755196677],
            "type": "Caldera",
            "summitFeet": 3114,
            "magmaType": "Rhyolite",
            "desc": "Colli Albani is a caldera in Italy. It was formed during an eruptive period with six major explosions that produced at least 280 km3 of ejecta between about 560,000 and 350,000 years ago."
        },
        {
            "name": "Timber Mountain Caldera Complex",
            "vei": 8,
            "coordinates": [37.04825611043948, -116.43482231224364],
            "type": "Caldera",
            "summitFeet": 10603,
            "magmaType": "Rhyolite",
            "desc": "Timber Mountain Caldera Complex is a caldera complex in Nevada, USA. It produced over 4 supereruptions during its lifetime. 2 of them being rated as a 8 on the VEI scale."
        },
        {
            "name": "Campi Flegrei del Mar di Sicilia",
            "vei": 3,
            "coordinates": [37.0999647760906, 12.700085781438988],
            "type": "Volcanic Field",
            "summitFeet": -26,
            "magmaType": "Andesite",
            "desc": "Campi Flegrei del Mar di Sicilia is a group of submarine volcanoes in Italy. The volcanoes were constructed within a submarine depression about 1 km deep in the Strait of Sicily between the SW coast of Sicily and the NE tip of Tunisia, forming submarine banks that are capped by cones that rise to near sea level."
        },
        {
            "name": "Nisyros",
            "vei": 2,
            "coordinates": [36.5884619640597, 27.16625061992239],
            "type": "Stratovolcano",
            "summitFeet": 2290,
            "magmaType": "Andesite",
            "desc": "Nisyros is a stratovolcano in Greece. Historical phreatic eruptions occurred from craters within the caldera between 1422 and 1888."
        },
        {
            "name": "Vulcano",
            "vei": 4,
            "coordinates": [38.39881170411273, 14.964967722224293],
            "type": "Stratovolcano",
            "summitFeet": 1640,
            "magmaType": "Rhyolite",
            "desc": "Vulcano is a volcanic island in Italy. The english word for volcano is derived from Vulcano."
        },
        {
            "name": "Zavodovski",
            "vei": 2,
            "coordinates": [-56.2987355722594, -27.575700211110885],
            "type": "Stratovolcano",
            "summitFeet": 1808,
            "magmaType": "Basalt",
            "desc": "Zavodovski is a stratovolcano in the overseas UK. It is the northernmost of the South Sandwich Islands and consists of one major stratovolcano, Mount Curry, which is surrounded to the east by a plain formed by lava flows."
        },
        {
            "name": "Candlemas Island",
            "vei": 2,
            "coordinates": [-57.09878400875697, -26.709205496948666],
            "type": "Stratovolcano",
            "summitFeet": 1804,
            "magmaType": "Basalt",
            "desc": "Candlemas Island is a stratovolcano in the overseas UK. A 6,000 years old tephra layer in the Vostok and South Pole ice cores has been tentatively attributed to a large explosive eruption at Candlemas, which would have spread ash over a distance of 4,000 kilometres (2,500 mi)."
        },
        {
            "name": "Bristol Island",
            "vei": 3,
            "coordinates": [-59.05341967383996, -26.603045812451573],
            "type": "Stratovolcano",
            "summitFeet": 3609,
            "magmaType": "Basalt",
            "desc": "Bristol Island is a stratovolcano in overseas UK. Recorded activity at Bristol goes back 150 years. Eruptions have been observed in 1823, 1935-1936, 1950 and 1956, and traces of very recent eruptions in 1964. A steaming crater was reported in 1962 which is presently buried under snow and ice."
        },
        {
            "name": "Saunders",
            "vei": 2,
            "coordinates": [-57.80261691232282, -26.487850331930414],
            "type": "Shield",
            "summitFeet": 4495,
            "magmaType": "Basalt",
            "desc": "Saunders is a shield volcano in the overseas UK. About 80% of the island is covered by ice. Rocky outcrops occur at the coasts, eroded pyroclastic cones on the eastern side and the Mount Michael volcano."
        },
        {
            "name": "Southern Thule",
            "vei": 1,
            "coordinates": [-59.4444139595198, -27.36443046922644],
            "type": "Stratovolcano",
            "summitFeet": 3527,
            "magmaType": "Basalt",
            "desc": "Southern Thule is a stratovolcano in the overseas UK. In 1954–1956, the Argentinians built a hut on Thule Island, at Hewison Point, and named it Teniente Esquivel, but abandoned it after witnessing a large eruption on Bristol Island. "
        },
        {
            "name": "Montagu",
            "vei": 1,
            "coordinates": [-58.4314176176131, -26.33653839710834],
            "type": "Shield",
            "summitFeet": 2766,
            "magmaType": "Basalt",
            "desc": "Montagu is a shield voclano in the overseas UK. The island was named by Cook after John Montagu, 4th Earl of Sandwich, at the time First Lord of the Admiralty."
        },
        {
            "name": "Dotsero",
            "vei": 2,
            "coordinates": [39.660852335765625, -107.03517170912815],
            "type": "Maar",
            "summitFeet": 7316,
            "magmaType": "Basalt",
            "desc": "Dotsero is a maar in Colorado. Erupting approximately 4200 years ago, it is the youngest volcano in Colorado."
        },
        {
            "name": "Mammoth Mountain",
            "vei": 2,
            "coordinates": [37.631776451040665, -119.03099106271962],
            "type": "Lava Dome",
            "summitFeet": 11053,
            "magmaType": "Dacite",
            "desc": "Mammoth Mountain is a lava dome in California. Mammoth Mountain was formed in a series of eruptions that ended 57,000 years ago. Mammoth still produces hazardous volcanic gases that kill trees."
        },
        {
            "name": "Hell's Half Acre",
            "vei": 0,
            "coordinates": [43.498629725466934, -112.45135406095031],
            "type": "Volcanic Field",
            "summitFeet": 5351,
            "magmaType": "Basalt",
            "desc": "Hell's Half Acre is a volcanic field in Idaho. In 1986, the Bureau of Land Management recommended that 68,760 acres (27,830 ha) of the site, located just southeast of the National Natural Landmark, to be a wilderness study area."
        },
        {
            "name": "Black Rock Desert Volcanic Field",
            "vei": 2,
            "coordinates": [38.806001731268644, -112.48590107298162],
            "type": "Volcanic Field",
            "summitFeet": 5906,
            "magmaType": "Rhyolite",
            "desc": "Black Rock Desert is a volcanic field in Utah. The field's Ice Springs event was an explosive eruption followed by lava flows that were Utah's most recent volcanic activity (1140–1440 AD)."
        },
        {
            "name": "El Chichón",
            "vei": 5,
            "coordinates": [17.359120095488695, -93.22703558160468],
            "type": "Lava Domes",
            "summitFeet": 3773,
            "magmaType": "Andesite",
            "desc": "El Chichón is a lava dome complex in Mexico. El Chichón became famous for its 1982 eruption. In little under a week, the presumed dormant volcano produced three plinian eruptions (March 29, April 3, and April 4)."
        },
        {
            "name": "Volcán de Colima",
            "vei": 5,
            "coordinates": [19.512091009504303, -103.61785220042714],
            "type": "Stratovolcano",
            "summitFeet": 12631,
            "magmaType": "Andesite",
            "desc": "Volcán de Colima is a stratovolcano in Mexico. In light of its history of large eruptions and situation in a densely populated area, it was designated a Decade Volcano, singling it out for study."
        },
        {
            "name": "Chichinautzin",
            "vei": 4,
            "coordinates": [19.20653482068897, -99.25857516738934],
            "type": "Volcanic Field",
            "summitFeet": 12920,
            "magmaType": "Basalt",
            "desc": "Chichinautzin is a volcanic field in Mexico. The southern part of Mexico City and the National University of Mexico, in the greater El Pedegral district, lie atop the distal end of the 13 kilometres (8.1 mi) long lava flow."
        },
        {
            "name": "Mascota Volcanic Field",
            "vei": 3,
            "coordinates": [20.557634854153864, -104.77225220871271],
            "type": "Volcanic Field",
            "summitFeet": 8284,
            "magmaType": "Basalt",
            "desc": "Mascota is a volcanic field in Mexico. Minettes of the Mascota volcanic field are the world's youngest. Potassium-argon dating has yielded ages of 70,000 ± 80,000 years ago for these."
        },
        {
            "name": "San Martín",
            "vei": 4,
            "coordinates": [18.562599789889383, -95.2014954520249],
            "type": "Shield",
            "summitFeet": 5413,
            "magmaType": "Basanite",
            "desc": "San Martín is a shield volcano located in the Tuxtla volcanic field, Mexico. The flanks of the volcano are dotted with 250 pyroclastic cones and maars, some of which have been active in historical times. The volcano is currently densely forested."
        },
        {
            "name": "Socorro",
            "vei": 2,
            "coordinates": [18.79454557531603, -110.96888740451325],
            "type": "Shield",
            "summitFeet": 3445,
            "magmaType": "Basalt",
            "desc": "Socorro is a shield volcano in Mexico. It is the largest of the four islands of the Revillagigedo Archipelago."
        },
        {
            "name": "Volcán Tacaná",
            "vei": 4,
            "coordinates": [15.132105503058476, -92.10892078044346],
            "type": "Stratovolcano",
            "summitFeet": 13320,
            "magmaType": "Andesite",
            "desc": "Tacaná is a stratovolcano in Mexico. Tacaná is the first of hundreds of volcanoes in a 1,500 km (930 mi) km row, arranged NW to SE, parallel to the Pacific Ocean coast of Central America, known as the Central America Volcanic Arc, formed by an active subduction zone along the western boundary of the Caribbean Plate."
        },
        {
            "name": "El Azufre",
            "vei": 5,
            "coordinates": [27.47036018985008, -112.59084276630168],
            "type": "Stratovolcano",
            "summitFeet": 6360,
            "magmaType": "Dacite",
            "desc": "El Azufre is a complex of 3 stratovolcanoes in Baja California, Mexico. The ground floor of El Azufre volcano holds the oldest rock in the region which is a granitic rock of the Cretaceous era."
        },
        {
            "name": "Heard",
            "vei": 2,
            "coordinates": [-53.11386146942705, 73.53641997737441],
            "type": "Stratovolcano",
            "summitFeet": 9006,
            "magmaType": "Basalt",
            "desc": "Heard is a stratovolcano in Australia. Volcanic activity at the cone has been known since 1881."
        },
        {
            "name": "McDonald Islands",
            "vei": 1,
            "coordinates": [-53.039950354400936, 72.59363538315138],
            "type": "Complex",
            "summitFeet": 755,
            "magmaType": "Phonolite",
            "desc": "McDonald Islands is a complex volcano in Australia. In 2024, it got some notoriety thanks to an intrigue between two Fast Food Giants, McDonald's, and Burger King. The latest wants to change the island name to Ilha Whopper (Whopper Island) affirming that a place with real fire can't be named McDonald's."
        },
        {
            "name": "Waw an Namous",
            "vei": 5,
            "coordinates": [24.913708735145068, 17.76136289040332],
            "type": "Caldera",
            "summitFeet": 1542,
            "magmaType": "Basalt",
            "desc": "Waw an Namous is a caldera in Libya. The volcano is also known as Uaw en Namus, Uau en Namus, Wau-en-Namus and Wau Sqair. It means Oasis of mosquitoes, a reference to the small lakes around it and the numerous mosquitoes that exist at Waw an Namus, nurtured by the lakes at the volcano."
        },
        {
            "name": "Harra es-Sawâd",
            "vei": 3,
            "coordinates": [13.579968700129392, 46.119946352082515],
            "type": "Volcanic Field",
            "summitFeet": 5699,
            "magmaType": "Basalt",
            "desc": "Harra es-Sawâd is a volcanic field in Yemen. The only eruption that has been noted in historical times occurred in 1253. This eruption was a large VEI 3 eruption, although it was poorly documented. Given the age of the field, other eruptions may have occurred in the recent past."
        },
        {
            "name": "Harra of Arhab",
            "vei": 2,
            "coordinates": [15.597085297160671, 44.04622837840985],
            "type": "Volcanic Field",
            "summitFeet": 10171,
            "magmaType": "Basalt",
            "desc": "Harra of Arhab is a volcanic field in Yemen. Harra of Arhab is the northernmost, historically active volcanic field in Yemen."
        },
        {
            "name": "Jebel at Tair",
            "vei": 3,
            "coordinates": [15.540546077487175, 41.8340492192371],
            "type": "Stratovolcano",
            "summitFeet": 801,
            "magmaType": "Basalt",
            "desc": "Jebel at Tair is a stratovolcano in Yemen. Yemen maintained a military base on the island from the dispute with Eritrea in 1996 until the 2007 eruption. There are or were two watchtowers for control and observation of the large warships, cargo ships, and oil tankers that pass by."
        },
        {
            "name": "Tor Zawar",
            "vei": 0,
            "coordinates": [30.4797218284789, 67.47566482594792],
            "type": "Fissure Vent",
            "summitFeet": 7339,
            "magmaType": "Basalt",
            "desc": "Tor Zawar is a fissure vent in Pakistan. An eruption in the region on January 29, 2010 surprised volcanologists because no previous volcanic activity had ever taken place there before."
        },
        {
            "name": "Gueishan Dao",
            "vei": 2,
            "coordinates": [24.84303477857467, 121.95193270920406],
            "type": "Stratovolcano",
            "summitFeet": 1184,
            "magmaType": "Andesite",
            "desc": "Gueishan Dao is a stratovolcano in Taiwan. Endemic species of crab, Xenograpsus testudinatus feeds on sulfur and lives around underwater hot springs of the island."
        },
        {
            "name": "Ile des Cendres",
            "vei": 2,
            "coordinates": [10.157886047476158, 109.01397174718909],
            "type": "Volcanic Field",
            "summitFeet": -66,
            "magmaType": "Basalt",
            "desc": "Ile des Cendres is a submarine volcanic field in Vietnam. A recent eruption was recorded in 1923 which formed land that was later removed again by the sea."
        },
        {
            "name": "Bir Borhut",
            "vei": 0,
            "coordinates": [15.515217941305814, 50.93457270244481],
            "type": "Volcanic Field",
            "summitFeet": 3088,
            "magmaType": "Basalt",
            "desc": "Bir Borhut is a Volcanic Field in Yemen. Although Bir Borhut has no recorded eruptions, there is one potential recorded eruption in 950 AD that possibly formed the Lava Cone we now have today."
        },
        {
            "name": "Harras of Dhamar",
            "vei": 3,
            "coordinates": [14.595027357254368, 44.48912777396913],
            "type": "Volcanic Field",
            "summitFeet": 3647,
            "magmaType": "Rhyolite",
            "desc": "Harras of Dhamar is a Volcanic Field in Yemen. This is a Geologically Interesting Volcanic Field with younger basaltic Lavas and Older Rhyolitic Lavas. the only known recorded eruption was in 1937 with residents reporting loud noises flames and lava fountains. This Volcanic Field contains one of the few places in the world to find Peridot. It is a green gemstone that forms in volcanic rocks. It is also known as The Birthstone of August. This is part of the Afar Triangle."
        },
        {
            "name": "Jabal Haylan",
            "vei": 0,
            "coordinates": [15.510316859386249, 45.02024038893415],
            "type": "Volcanic Field",
            "summitFeet": 9892,
            "magmaType": "Basalt",
            "desc": "Jabal Haylan is a Volcanic Field in Yemen. This Volcanic Field had only 1 known eruption in 1200 BC with only a lava flow and it is the only known eruption from that Volcanic Field"
        },
        {
            "name": "Jabal el-Marha",
            "vei": 4,
            "coordinates": [15.243796754011722, 44.23646380868304],
            "type": "Cinder Cone",
            "summitFeet": 1000,
            "magmaType": "Andesite",
            "desc": "Jabal el-Marha is a Cinder Cone in Yemen. Although Jabal el-Marha has no eruptions, the landforms at the area have andesitic minerals at the volcano as well as either a Collapsed Cinder Cone or an eroding Cinder Cone."
        },
        {
            "name": "Theistareykjarbunga",
            "vei": 0,
            "coordinates": [65.89566491428711, -16.844649249136786],
            "type": "Shield",
            "summitFeet": 1850,
            "magmaType": "Basalt",
            "desc": "Theistareykjarbunga is a shield volcano in Iceland. There have been three dated eruptions, all VEI-0: the most recent eruption was around 900 BCE and the previous eruption was in 6800 BCE. Around 9500 BCE, an eruption produced approximately 18 billion cubic metres of basaltic lava."
        },
        {
            "name": "Dallol",
            "vei": 1,
            "coordinates": [14.24183094191987, 40.29780379957173],
            "type": "Explosion Crater",
            "summitFeet": -157,
            "magmaType": "Basalt",
            "desc": "Dallol is an explosion crater in Ethiopia. It is known for its unearthly colors and mineral patterns, and the very acidic fluids that discharge from its hydrothermal springs."
        },
        {
            "name": "Yakedake",
            "vei": 4,
            "coordinates": [36.22704896277033, 137.58696014277166],
            "type": "Stratovolcano",
            "summitFeet": 8054,
            "magmaType": "Basalt",
            "desc": "Yakedake is a stratovolcano in Japan. Mount Yake is the most active of all the volcanoes in the Hida Mountains."
        },
        {
            "name": "Emuruangogolak",
            "vei": 0,
            "coordinates": [1.4998712239800749, 36.331501978148495],
            "type": "Shield",
            "summitFeet": 4216,
            "magmaType": "Basalt",
            "desc": "Emuruangogolak is a shield volcano in Kenya. The last known eruption was a trachyte flow which occurred in 1910. Steam vents and fumarolic activity continues from fissures within the caldera and along the flanks of the volcano."
        },
        {
            "name": "Auckland Volcanic Field",
            "vei": 4,
            "coordinates": [-36.78763794006866, 174.85810813337133],
            "type": "Volcanic Field",
            "summitFeet": 850,
            "magmaType": "Basalt",
            "desc": "Auckland Volcanic Field is a volcanic field in New Zealand. Tāmaki Māori myths describe the creation of the volcanic field as a creation of Mataaho (the guardian of the earth's secrets) and his brother Rūaumoko (the god of earthquakes and volcanoes), made as punishment against a tribe of patupaiarehe, supernatural beings living in the Waitākere Ranges, who used deadly magic from the earth to defeat a war party of patupaiarehe from the Hunua Ranges."
        },
        {
            "name": "Buckle Island",
            "vei": 2,
            "coordinates": [-66.77997830741522, 163.2218226651609],
            "type": "Stratovolcano",
            "summitFeet": 4065,
            "magmaType": "Basalt",
            "desc": "Buckle Island is a stratovolcano in Antarctica. The island forms some parts of the Ross Dependency, claimed by New Zealand."
        },
        {
            "name": "Oku Volcanic Field",
            "vei": 4,
            "coordinates": [6.438282164819316, 10.29921346499181],
            "type": "Volcanic Field",
            "summitFeet": 9879,
            "magmaType": "Rhyolite",
            "desc": "Oku is a volcanic field in Cameroon. The Oku Volcanic Field includes two crater lakes, Lake Nyos to the north and Lake Monoun to the south. On 15 August 1984, an earthquake and landslide triggered a major release of carbon dioxide from Lake Monoun, killing several people."
        },
        {
            "name": "Alney-Chashakondzha",
            "vei": 3,
            "coordinates": [56.6926184884554, 159.64519943466368],
            "type": "Stratovolcano",
            "summitFeet": 8432,
            "magmaType": "Andesite",
            "desc": "Alney-Chashakondzha is a stratovolcano in Russia. Alney is one of the few large stratovolcanoes in the Sredinny Range known to have been active throughout the Holocene, with more than 30 documented pyroclastic deposits. The last intense eruption took place about 350 years ago."
        },
        {
            "name": "Koshelev",
            "vei": 3,
            "coordinates": [51.35880014224413, 156.7496640769982],
            "type": "Stratovolcano",
            "summitFeet": 5978,
            "magmaType": "Basalt",
            "desc": "Koshelev is a complex of stratovolcanoes in Russia. Major thermal fields are located in the summit crater of Valentin volcano and on the western flanks of west Koshelev volcano."
        },
        {
            "name": "Wudalianchi",
            "vei": 3,
            "coordinates": [48.65327449785573, 126.28624062210085],
            "type": "Volcanic Field",
            "summitFeet": 1959,
            "magmaType": "Basalt",
            "desc": "Wudalianchi is a volcanic field in China. The volcanic field, whose name means Five Connected Pools was formed during five eruptive cycles from the early Pleistocene to historical time. Its ancient name was Nine Hills, which after the historical eruptions now number 14 hills."
        },
        {
            "name": "Hudson Mountains",
            "vei": 4,
            "coordinates": [-74.33422255955074, -99.418888743375],
            "type": "Volcanic Field",
            "summitFeet": 2457,
            "magmaType": "Basalt",
            "desc": "Hudson Mountains is a stratovolcano in Antarctica. The volcanism at the mountains may have either been caused by a mantle plume under Marie Byrd Land or by the presence of anomalies (slab windows) in the mantle left over by subduction."
        },
        {
            "name": "Berlin",
            "vei": 5,
            "coordinates": [-76.0531737292911, -135.86666421857433],
            "type": "Shield",
            "summitFeet": 11411,
            "magmaType": "Phonolite",
            "desc": "Mount Berlin is a shield volcano in Antarctica. Mount Berlin was active from the Pliocene into the Holocene. The oldest parts are found at Wedemeyer Rocks and Brandenberger Bluff and are 2.7 million years old."
        },
        {
            "name": "Chinati Mountain Caldera Complex",
            "vei": 8,
            "coordinates": [29.884042484072843, -104.4372456514142],
            "type": "Caldera",
            "summitFeet": 7728,
            "magmaType": "Rhyolite",
            "desc": "Chinati Mountain Caldera Complex is a caldera complex in Texas. It is the largest and most documented volcano within the Trans-Pecos Volcanic Field, consisting mostly of two calderas: the Infernito Caldera and the Chinati Mountain Caldera."
        },
        {
            "name": "Ōdai Caldera",
            "vei": 8,
            "coordinates": [34.17756578801184, 136.1043511412198],
            "type": "Caldera",
            "summitFeet": 5640,
            "magmaType": "Rhyolite",
            "desc": "Ōdai Caldera is a caldera in Japan. In 1980, an area of 36,000 hectares in the region of Mount Ōdaigahara and Mount Ōmine was designated a UNESCO Man and the Biosphere Reserve."
        },
        {
            "name": "William's Ridge",
            "vei": 8,
            "coordinates": [38.53690818878468, -116.14402207822496],
            "type": "Caldera",
            "summitFeet": 6624,
            "magmaType": "Rhyolite",
            "desc": "William's Ridge is a caldera in Nevada. It erupted about 3,500 km3 of material 31,4 million years ago."
        },
        {
            "name": "Kola Alkaline Province",
            "vei": 9,
            "coordinates": [67.71048324549665, 36.095922042511376],
            "type": "Large Igneous Province",
            "summitFeet": 3940,
            "magmaType": "Basalt",
            "desc": "Kola Alkaline Province is a large igneous province in Russia. It has an unsually small volume compared to other LIP's (15,000 km3) thus making it a VEI 9."
        },
        {
            "name": "Awasa Caldera",
            "vei": 8,
            "coordinates": [7.063285151142903, 38.44123172960617],
            "type": "Caldera",
            "summitFeet": 7610,
            "magmaType": "Rhyolite",
            "desc": "Awasa Caldera is a caldera in Ethiopia. Because it is relatively accessible to scientists, Lake Awasa is the most studied of the Rift Valley lakes in Ethiopia."
        },
        {
            "name": "Bruneau-Jarbidge Caldera",
            "vei": 8,
            "coordinates": [42.45236385063628, -115.62716934891482],
            "type": "Caldera",
            "summitFeet": 2952,
            "magmaType": "Rhyolite",
            "desc": "Bruneau-Jarbidge Caldera is a caldera in Idaho. By its uniquely characteristic chemical composition and the distinctive size and shape of its crystals and glass shards, the volcano stood out among dozens of prominent ashfall horizons laid down in the Cretaceous, Paleogene, and Neogene periods of central North America."
        },
        {
            "name": "McDermitt Caldera",
            "vei": 7,
            "coordinates": [41.84825065986883, -118.03631277580529],
            "type": "Caldera",
            "summitFeet": 6816,
            "magmaType": "Rhyolite",
            "desc": "McDermitt Caldera is a caldera on Oregon-Nevada border. Significant ore deposits are buried in the caldera, including mercury and uranium, which were mined at more than eight sites in the caldera during the 20th century."
        },
        {
            "name": "Hood",
            "vei": 2,
            "coordinates": [45.37398995560104, -121.69639344495037],
            "type": "Stratovolcano",
            "summitFeet": 11240,
            "magmaType": "Andesite",
            "desc": "Mount Hood, also known as Wy'east, is the highest mountain peak in the entire state of Oregon. It is part of the Cascade Volcanic Arc. It was discovered in 1792 by European explorers. Hood also hosts 12 big glaciers surrounding the volcano's summit."
        },
        {  
            "name": "Unzen",
            "vei": 2,
            "coordinates": [32.778550468039846, 130.26720414330634],
            "type": "Complex",
            "summitFeet": 4875,
            "magmaType": "Andesite",
            "desc": "Unzen, despite only having a max eruption intensity of a VEI 2, is infamous because during an eruption in 1792, a post-eruption earthquake caused part of the volcano to fall off and create a massive megatsunami that was estimated to kill 15,000 people. It has also had many more deadly eruptions."
        },   
        {
            "name": "Raoul Island",
            "vei": 6,
            "coordinates": [-29.264974371467268, -177.91923803092646],
            "type": "Stratovolcano",
            "summitFeet": 1693,
            "magmaType": "Dacite",
            "desc": "On March 17 2006, a 40-second long eruption occured, killing one person. It is apart of the Kermadec Islands."
        },
        {
            "name": "Macauley Island",
            "vei": 7,
            "coordinates": [-30.232899546302594, -178.42921785976202],
            "type": "Stratovolcano",
            "summitFeet": 1693,
            "magmaType": "Basalt",
            "desc": "Macauley Island is a tiny island part of the Kermadec Islands Chain, but don't let that fool you, as the volcano likely produced a VEI 7 eruption during the Holocene era."
        },   
        {
            "name": "Lake Ilopango",
            "vei": 6,
            "coordinates": [13.669109951289803, -89.03997924728905],
            "type": "Caldera",
            "summitFeet": 1476,
            "magmaType": "Dacite",
            "desc": "Lake Ilopango's eruption in the year 450 was the largest recorded eruption in El Salvador to date, likely covering the entire country in ash. It was also larger than the 1883 Krakatoa eruption as well as the 1991 Pinatubo eruption. The eruption devastated an area of up to 100 km radius around the volcano. It covered over 2,000,000 square kilometers in at least 0.5cm of ash in depth."
        },
        {
            "name": "Mount Hudson",
            "vei": 6,
            "coordinates": [-45.9061777015585, -72.97060180667529],
            "type": "Caldera",
            "summitFeet": 6250,
            "magmaType": "Rhyolite",
            "desc": "Mount Hudson is a stratovolcano in Chile. During the 1991 eruption, volcanic ash covered a large area in Chile and neighbouring Argentina, causing high mortality in farm animals, aggravating an existing economic crisis, and depositing ash as far as Antarctica."
        },
        {
            "name": "Cadamosto Seamount",
            "vei": 4,
            "coordinates": [14.665283597429683, -24.909872487133853],
            "type": "Stratovolcano",
            "summitFeet": -4860,
            "magmaType": "Phonolite",
            "desc": "Cadamosto Seamount is a submarine stratovolcano in Cabo Verde. The seamount has had intense volcanic eruptions in the late Pleistocene, and recent seismic activity indicates that volcanism is ongoing."
        },
        {
            "name": "Healy",
            "vei": 6,
            "coordinates": [-34.98803606854899, 179.00051627352153],
            "type": "Stratovolcano",
            "summitFeet": -4860,
            "magmaType": "Rhyodacite",
            "desc": "Healy is a seamount in the Kermadec Islands. Parts of the Loisels Pumice in New Zealand are suspected to have originated in this eruption, which took place 590±80 years before present (1950). Healy is also suspected to be the source of a tsunami that impacted Maori communities during the 15th century, and may be a continuing tsunami hazard."
        },
        {
            "name": "Unnamed",
            "vei": 0,
            "coordinates": [20.329188771667745, 121.75004235751464],
            "type": "Stratovolcano",
            "summitFeet": -79,
            "magmaType": "Basalt",
            "desc": "Unnamed 274050 is a submarine startovolcano in the Philippines. Submarine eruptions reported in 1773, 1850, and 1854 are likely to have originated from this volcano. There have been no further reports since 1854."
        },
        {
            "name": "Vailulu'u",
            "vei": 0,
            "coordinates": [-14.2181511117373, -169.05734105763784],
            "type": "Shield",
            "summitFeet": -1942,
            "magmaType": "Basalt",
            "desc": "Vailulu'u is a submarine shield volcano in the American Samoa. Eruptions at Vailuluʻu were recorded in 1973. An earthquake swarm in 1995 may have been related to an eruption from the seamount. Turbid water above the summit shows evidence of ongoing hydrothermal plume activity. Vailuluʻu may breach the surface of the ocean and officially become an island if a high rate of eruptions continue."
        },
        {
            "name": "Monaco Bank",
            "vei": 1,
            "coordinates": [36.5954494727917, -25.881840964959903],
            "type": "Fissure Vent",
            "summitFeet": -646,
            "magmaType": "Basalt",
            "desc": "Monaco Bank is a submarine fissure vent in the Azores. Submarine eruptions took place during 1911 and 1907, when a submarine cable was ruptured."
        },
        {
            "name": "Hebrides Terrace Seamount",
            "vei": 0,
            "coordinates": [56.44715879522802, -10.338838158837596],
            "type": "Guyot",
            "summitFeet": -3280,
            "magmaType": "Basalt",
            "desc": "Hebrides Terrace Seamount is a guyot in the UK. The formation of the Hebrides Terrace Seamount began after the Cretaceous-Palaeogene extinction event. In the early Cenozoic, three pulses of volcanic activity generated the seamount."
        },
        {
            "name": "Cortes Bank",
            "vei": 1,
            "coordinates": [32.464950405277136, -119.1646765473351],
            "type": "Stratovolcano",
            "summitFeet": -3,
            "magmaType": "Basalt",
            "desc": "Cortes Bank is a submarine volcano in the US. At various times during geologic history, the bank has been an island, depending on sea level rise and fall. The last time it was a substantial island was around 10,000 years ago during the last ice age. It is possible that this island was visited by the first human inhabitants of the Channel Islands, most notably San Clemente Island, whose seafaring residents would have been able to see the island from high elevations on clear days."
        },
        {
            "name": "Kemp Caldera",
            "vei": 6,
            "coordinates": [-59.69983172630644, -28.246776177105524],
            "type": "Caldera",
            "summitFeet": -260,
            "magmaType": "Basalt",
            "desc": "Kemp Caldera is a caldera in the South Sandwich Islands. The caldera was discovered and sampled in 2009 during bathymetric mapping operations carried out by the RRS James Clark Ross."
        },
        {
            "name": "Quitman Caldera",
            "vei": 7,
            "coordinates": [31.114446448816718, -105.51438134208709],
            "type": "Caldera",
            "summitFeet": 6589,
            "magmaType": "Rhyolite",
            "desc": "Quitman Caldera is a caldera in Texas. It has erupted over 300 km^3 of Square Peak Volcanics over 36 mya."
        },
        {
            "name": "Oxaya Formation",
            "vei": 8,
            "coordinates": [-18.402657889691277, -69.79987689189055],
            "type": "Geological Formation",
            "summitFeet": 3300,
            "magmaType": "Rhyolite",
            "desc": "Oxaya Formation is a geological formation in Chile. The formation formed about 25 to 19 million years ago in the Late Oligocene and Early Miocene."
        },
        {
            "name": "Akademia Nauk",
            "vei": 7,
            "coordinates": [53.9844707845623, 159.46354146605475],
            "type": "Caldera",
            "summitFeet": 3870,
            "magmaType": "Rhyolite",
            "desc": "Akademia Nauk is a caldera in Russia. The volcano is named after the Российская Академия Наук, the Russian (Soviet) Academy of Sciences."
        },
        {
            "name": "Ashikule Volcanic Field",
            "vei": 2,
            "coordinates": [35.735662799373145, 81.56606477676647],
            "type": "Volcanic Field",
            "summitFeet": 16699,
            "magmaType": "Trachyandesite",
            "desc": "Ashikule Volcanic Field is a volcanic field in China. The latest eruption was on 27 May 1951, at Ashi volcano as was reported by the newspaper Xinjiang Daily. The report claimed that soldiers building a road heard roaring and saw a column of smoke, which continued for several days."
        },
        {
            "name": "Sinabung",
            "vei": 4,
            "coordinates": [3.1700211706764265, 98.39210432570779],
            "type": "Stratovolcano",
            "summitFeet": 8070,
            "magmaType": "Andesite",
            "desc": "Sinabung is a stratovolcano in Indonesia. The volcano has recently claimed the life of at least 23 people in a number of events since 2014."
        },
        {
            "name": "Kerinci",
            "vei": 2,
            "coordinates": [-1.6956591428505619, 101.26600206118837],
            "type": "Stratovolcano",
            "summitFeet": 12484,
            "magmaType": "Andesite",
            "desc": "Kerinci is a stratovolcano in Indonesia. Based on research in 1973, the 'Kecik Wok Gedang Wok' people are recognized as the first tribe to settle at a plateau around Mount Kerinci 10,000 years ago."
        },
        {
            "name": "Galunggung",
            "vei": 5,
            "coordinates": [-7.25701089780806, 108.07040372964057],
            "type": "Stratovolcano",
            "summitFeet": 7113,
            "magmaType": "Andesite",
            "desc": "Galunggung is a stratovolcano in Indonesia. Galunggung had its first historical eruption in 1822 that produced pyroclastic flows and lahars that killed 4,011 people."
        },
        {
            "name": "Melibengoy",
            "vei": 5,
            "coordinates": [6.101377256319772, 124.8891359224847],
            "type": "Stratovolcano",
            "summitFeet": 5984,
            "magmaType": "Andesite",
            "desc": "Melibengoy is a stratovolcano in the Philippines. Mount Parker is believed to have erupted thrice over the past 3,800 years, the last one on January 4, 1641."
        },
        {
            "name": "Popa",
            "vei": 4,
            "coordinates": [20.92660945859985, 95.2448411258172],
            "type": "Stratovolcano",
            "summitFeet": 4980,
            "magmaType": "Basalt",
            "desc": "Popa is a stratovolcano in Myanmar. Many legends are associated with this mountain including its dubious creation from a great earthquake and the mountain erupted out of the ground in 442 BC."
        },
        {
            "name": "Eyjafjallajökull",
            "vei": 4,
            "coordinates": [63.629275750196456, -19.619552351805716],
            "type": "Stratovolcano",
            "summitFeet": 5466,
            "magmaType": "Basalt",
            "desc": "Eyjafjallajökull is a stratovolcano in Iceland. The 2010 eruption of this volcano caused one of the biggest air travel disruptions in history."
        },
        {
            "name": "Surtsey",
            "vei": 3,
            "coordinates": [63.3040110827198, -20.611347980996676],
            "type": "Shield",
            "summitFeet": 509,
            "magmaType": "Basalt",
            "desc": "Surtsey is a shield volcano in Iceland. The island was named after Surtr, a fire jötunn or giant from Norse mythology."
        },
        {
            "name": "Merapi",
            "vei": 4,
            "coordinates": [-7.54098270197486, 110.44564408526578],
            "type": "Stratovolcano",
            "summitFeet": 9550,
            "magmaType": "Andesite",
            "desc": "Merapi is a stratovolcano in Indonesia. Merapi is very important to the Javanese people, especially those living around its crater. As such, there are many myths and beliefs attached to Merapi."
        },
        {
            "name": "Semeru",
            "vei": 4,
            "coordinates": [-8.111651977359957, 112.92408284635941],
            "type": "Stratovolcano",
            "summitFeet": 12060,
            "magmaType": "Andesite",
            "desc": "Semeru is a stratovolcano in Indonesia. Semeru is named after Sumeru, the central world mountain in Hinduism. As stated in legend, it was transplanted from India to create the island of Java; the tale is recorded in the 15th-century East Javanese work Tantu Pagelaran."
        },
        {
            "name": "Rotorua Caldera",
            "vei": 7,
            "coordinates": [-38.079065845549266, 176.2712995743315],
            "type": "Caldera",
            "summitFeet": 2484,
            "magmaType": "Rhyolite",
            "desc": "Rotorua Caldera is a caldera in New Zealand. The caldera was formed in a single event paired major eruption, lasting only weeks, that is now dated to 240,000 ± 11,000 years ago. It ejected more than 340 cubic kilometres (82 cu mi) of rhyolitic Mamaku ignimbrite giving it a Volcanic Explosivity Index of 7."
        },
        {
            "name": "Sumisu-tō",
            "vei": 6,
            "coordinates": [31.44625626285685, 140.04427425558336],
            "type": "Caldera",
            "summitFeet": 440,
            "magmaType": "Basalt",
            "desc": "Sumisu-tō is a caldera in Japan. The abundance of fish in the surrounding waters have made it attractive for both sport and commercial fishing."
        },
        {
            "name": "The Barrier",
            "vei": 6,
            "coordinates": [2.320839645558741, 36.58837594194435],
            "type": "Shield",
            "summitFeet": 3386,
            "magmaType": "Trachyte",
            "desc": "The Barrier is a shield volcano in Kenya. The Barrier was given its name because it forms a barrier about 20 kilometres (12 mi) long across the Kenyan Rift Valley."
        },
        {
            "name": "Hakone",
            "vei": 6,
            "coordinates": [35.232360991052964, 139.02133589049723],
            "type": "Complex",
            "summitFeet": 4718,
            "magmaType": "Andesite",
            "desc": "Hakone is a caldera complex in Japan. The latest magmatic eruptive activity at Hakone occurred 2,900 years ago. It produced a pyroclastic flow and a lava dome in the explosion crater, although phreatic eruptions took place as recently as the 12–13th centuries AD."
        },
        {
            "name": "Santo Antão",
            "vei": 6,
            "coordinates": [17.04297517720256, -25.20586694722101],
            "type": "Stratovolcano",
            "summitFeet": 6493,
            "magmaType": "Phonolite",
            "desc": "Santo Antão is a stratovolcano in the Cabo Verde. The youngest eruptive products are lava flows that originated from vents at Cha de Lagoa in the central part of the island, just south of the NE-SW axial ridge."
        },
        {
            "name": "Mayon",
            "vei": 4,
            "coordinates": [13.254639639439311, 123.68587222117151],
            "type": "Stratovolcano",
            "summitFeet": 8081,
            "magmaType": "Andesite",
            "desc": "Mayon is a stratovolcano in the Philippines. Mayon is the most active volcano in the Philippines, and its activity is regularly monitored by the Philippine Institute of Volcanology and Seismology (PHIVOLCS) from their provincial headquarters on Ligñon Hill, about 12 kilometers (7.5 mi) from the summit."
        },
        {
            "name": "Babuyan Claro",
            "vei": 4,
            "coordinates": [19.524041363339602, 121.9496458035278],
            "type": "Stratovolcano",
            "summitFeet": 3304,
            "magmaType": "Andesite",
            "desc": "Babuyan Claro is a stratovolcano in the Philippines. It is classified as one of the active volcanoes of the country with the last confirmed eruption in 1860."
        },
        {
            "name": "Anjuisky",
            "vei": 4,
            "coordinates": [67.15593636043064, 165.82704080909664],
            "type": "Pyroclastic Cone",
            "summitFeet": 5118,
            "magmaType": "Trachybasalt",
            "desc": "Anjuisky is a pyroclastic cone in Russia. It was considered to have been active during the 14th and 18th centuries, but radiometric dating has shown ages of almost 250,000 years ago."
        },
        {
            "name": "Aluchin",
            "vei": 3,
            "coordinates": [66.10004846316336, 165.40105038533056],
            "type": "Pyroclastic Cone",
            "summitFeet": 230,
            "magmaType": "Trachybasalt",
            "desc": "Aluchin is a pyroclastic cone in Russia. The volcano is located in part of the Anyuy area where a fault dating back possibly to the Paleozoic cuts the terrain. Paleozoic and possibly Proterozoic rocks crop out at the sides of the fault. A number of volcanic rocks, both effusive and intrusive ones, are associated with the fault and go as far back as the Devonian."
        },
        {
            "name": "Jom-Bolok Volcanic Field",
            "vei": 4,
            "coordinates": [52.704221814728655, 99.0001139496517],
            "type": "Volcanic Field",
            "summitFeet": 6814,
            "magmaType": "Basalt",
            "desc": "Jom-Bolok Volcanic Field is a volcanic field in Russia.  The eruptions at Jom-Bolok are the most voluminous Holocene eruptions of Central Asia; their volume has been estimated to be 16 cubic kilometres (3.8 cu mi)."
        },
        {
            "name": "Hallasan",
            "vei": 5,
            "coordinates": [33.36126079525969, 126.53271040971877],
            "type": "Shield",
            "summitFeet": 6388,
            "magmaType": "Trachyte",
            "desc": "Hallasan is a shield volcano in South Korea. The Hallasan Natural Reserve was designated as a South Korean Natural Monument no. 182 on October 12, 1966."
        },
        {
            "name": "Ch'uga-ryong",
            "vei": 3,
            "coordinates": [38.32998350111643, 127.33019056446757],
            "type": "Shield",
            "summitFeet": 1483,
            "magmaType": "Basalt",
            "desc": "Ch'uga-ryong is a shield volcano in the DPRK. An area of extensive basaltic lava flows occupies a graben, the NNE-SSW-trending Ch'uga-ryong rift, that cuts diagonally across the demilitarized zone between North and South Korea."
        },
        {
            "name": "South Caucasus Basalt Province",
            "vei": 8,
            "coordinates": [41.12494746163948, 44.76710621358649],
            "type": "Large Igneous Province",
            "summitFeet": 7200,
            "magmaType": "Basalt",
            "desc": "South Caucasus Basalt Province is a large igneous province in the Caucausus region. It is the smallest and youngest Continental Flood Basalt in the world."
        },
        {
            "name": "Chilcotin Group",
            "vei": 8,
            "coordinates": [51.848175129854, -123.2528583791899],
            "type": "Large Igneous Province",
            "summitFeet": 5223,
            "magmaType": "Basalt",
            "desc": "Chilcotin Group is a large igneous province in Canada. Eruptions were most vigorous 6-10 million years ago and 2-3 million years ago, when most of the basalt was released. Less extensive eruptions continued 0.01 to 1.6 million years ago."
        },
        {  
            "name": "Lake Turkana South Island",
            "vei": 1,
            "coordinates": [2.6336970532670962, 36.58655786154834],
            "type": "Stratovolcano",
            "summitFeet": 2625,
            "magmaType": "Basalt",
            "desc": "Lake Turkana South Island is an island in Lake Turkana. It's only confirmed eruption was in 1888. While no one lives on the island, it is still part of the Lake Turkana National Park, which is part of UNESCO World Heritage."
        },
        {   
            "name": "Mambilla Plateau",
            "vei": 9,
            "coordinates": [7.598671699166901, 11.562448344543421],
            "type": "Volcanic Plateau",
            "summitFeet": 7936,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Garðar Large Igneous Province",
            "vei": 9,
            "coordinates": [60.979003910448405, -45.43669024248208],
            "type": "Large Igneous Province",
            "summitFeet": 5000,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Harts Range",
            "vei": 9,
            "coordinates": [-23.173422363773465, 134.84147266749724],
            "type": "Large Igneous Province",
            "summitFeet": 6000,
            "magmaType": "Basalt",
            "desc": ""
        },
        {
            "name": "Ontong Java Plateau",
            "vei": 10,
            "coordinates": [-3.0498285817740176, 160.38298967726698],
            "type": "Large Igneous Province",
            "summitFeet": 5600,
            "magmaType": "Basalt",
            "desc": "The Ontong Java Plateau (OJP) is a massive oceanic plateau located in the southwestern Pacific Ocean, north of the Solomon Islands. The OJP was formed around 116 million years ago in the Ontong Java Event, which represents the largest volcanic event of the past 200 million years, with a magma eruption rate estimated at up to 22 km3 (5.3 cu mi) per year over 3 million years, several times larger than the Deccan Traps. It covers an area of 579 thousand square miles, roughly the size of Alaska."
        },
        {
            "name": "Butler Hill Caldera",
            "vei": 6,
            "coordinates": [37.667830264991515, -90.40349827578153],
            "type": "Caldera",
            "summitFeet": 1004,
            "magmaType": "Rhyolite",
            "desc": "Butler Hill Caldera is a caldera in Missouri. It produced a giant eruption over 1 billion years ago. The estimated volume ranges from 32 to 100 km^3."
        },
        {
            "name": "Taum Sauk Caldera",
            "vei": 7,
            "coordinates": [37.570388498162025, -90.7331233869999],
            "type": "Caldera",
            "summitFeet": 1772,
            "magmaType": "Rhyolite",
            "desc": "Taum Sauk Caldera is a caldera in Missouri. It has produced several eruptions 1.48 billion years ago. One of the eruptions had an estimated ejecta volume of 600 km^3, thus making the Taum Sauk Caldera a VEI 7 volcano."
        },
        {
            "name": "Messum Crater",
            "vei": 8,
            "coordinates": [-21.418238282376944, 14.199761259866113],
            "type": "Caldera",
            "summitFeet": 1404,
            "magmaType": "Rhyolite",
            "desc": "Messum Crater is a caldera in Namibia. It is a part of the Etendeka Traps."
        },
        {  
            "name": "Ebeko",
            "vei": 2,
            "coordinates": [50.6850731323062, 156.01413431488643],
            "type": "Stratovolcano",
            "summitFeet": 3619,
            "magmaType": "Andesite",
            "desc": "This volcano has very recently erupted (and may be still erupting if you're reading this). It is one of the most active volcanoes in the Kurile Islands."
        },
        {
            "name": "Dunoko",
            "vei": 3,
            "coordinates": [1.6997423656999935, 127.86705294077143],
            "type": "Complex",
            "summitFeet": 4177,
            "magmaType": "Andesite",
            "desc": "Dunoko is one of the most active volcanoes in Indonesia. It has been erupting since 1933 continously, and it's likely still erupting as you're reading this."
        },
        {
            "name": "Wurzen Caldera",
            "vei": 8,
            "coordinates": [51.43886156376798, 13.022666120338343],
            "type": "Caldera",
            "summitFeet": 371,
            "magmaType": "Rhyodacite",
            "desc": "Wurzen Caldera is a 30x25 km caldera in Germany. The climactic Wurzen ignimbrite contains different fiamme of fine-grained mafic, fine-grained rhyolitic (71.8 to 76.6 wt% SiO2), porphyritic (trachy-) dacitic (64.5 to 67.6 wt% SiO2), and coarse porphyritic rhyodacitic composition (64.7 to 74.3 wt% SiO2), which point to a permanent interplay between rejuvenation, differentiation, and cooling in the Wurzen magma body."
        },
        {
            "name": "Raton-Clayton Volcanic Field",
            "vei": 3,
            "coordinates": [37.11539388867238, -103.57020632429922],
            "type": "Volcanic Field",
            "summitFeet": 4973,
            "magmaType": "Basalt",
            "desc": "Raton-Clayton Volcanic Field is a volcanic field in the USA. One of the lava flows from this volcano has reached Oklahoma."
        },
        {
            "name": "Talking tom caldera",
            "vei": 8,
            "coordinates": [38.90541691444108, -77.01924252207907],
            "type": "Farrttt",
            "summitFeet": 6666,
            "magmaType": "Liquid Robux",
            "desc": "Why?"
        }
    ]
}
